zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_LPE_VFCCU.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_LPE_VFCCU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_LPE_VFCCU_H_)  /* Check if memory map has not been already included */
#define S32K566_LPE_VFCCU_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPE_VFCCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_VFCCU_Peripheral_Access_Layer LPE_VFCCU Peripheral Access Layer
 * @{
 */

/** LPE_VFCCU - Register Layout Typedef */
typedef struct LPE_VFCCU_Struct {
  uint8_t RESERVED_0[1024];
  __IO uint32_t GFLTPO_C0;                         /**< Global Fault Polarity, offset: 0x400 */
  __IO uint32_t GFLTPO_C1;                         /**< Global Fault Polarity, offset: 0x404 */
  __IO uint32_t GFLTPO_C2;                         /**< Global Fault Polarity, offset: 0x408 */
  __IO uint32_t GFLTPO_C3;                         /**< Global Fault Polarity, offset: 0x40C */
  uint8_t RESERVED_1[48];
  __IO uint32_t GFLTRC_C0;                         /**< Global Fault Recovery, offset: 0x440 */
  __IO uint32_t GFLTRC_C1;                         /**< Global Fault Recovery, offset: 0x444 */
  __IO uint32_t GFLTRC_C2;                         /**< Global Fault Recovery, offset: 0x448 */
  __IO uint32_t GFLTRC_C3;                         /**< Global Fault Recovery, offset: 0x44C */
  uint8_t RESERVED_2[2232];
  __I  uint32_t GINTOVFS;                          /**< Global DID FSM Status, offset: 0xD08 */
  uint8_t RESERVED_3[676];
  __IO uint32_t GDBGCFG;                           /**< Global Debug, offset: 0xFB0 */
  __I  uint32_t GDBGSTAT;                          /**< Global Debug Status, offset: 0xFB4 */
  uint8_t RESERVED_4[72];
  __IO uint32_t FHCFG0;                            /**< Fault Handler, offset: 0x1000 */
  __I  uint32_t FHSRVDS0;                          /**< Fault Handler Status, offset: 0x1004 */
  uint8_t RESERVED_5[8];
  __IO uint32_t FHFLTENC0_0;                       /**< Fault Enable, offset: 0x1010 */
  __IO uint32_t FHFLTENC0_1;                       /**< Fault Enable, offset: 0x1014 */
  __IO uint32_t FHFLTENC0_2;                       /**< Fault Enable, offset: 0x1018 */
  __IO uint32_t FHFLTENC0_3;                       /**< Fault Enable, offset: 0x101C */
  uint8_t RESERVED_6[48];
  __IO uint32_t FHFLTS0_0;                         /**< Fault Status, offset: 0x1050 */
  __IO uint32_t FHFLTS0_1;                         /**< Fault Status, offset: 0x1054 */
  __IO uint32_t FHFLTS0_2;                         /**< Fault Status, offset: 0x1058 */
  __IO uint32_t FHFLTS0_3;                         /**< Fault Status, offset: 0x105C */
  uint8_t RESERVED_7[48];
  __IO uint32_t FHFLTRKC0_0;                       /**< Fault Reaction Set Configuration, offset: 0x1090 */
  __IO uint32_t FHFLTRKC0_1;                       /**< Fault Reaction Set Configuration, offset: 0x1094 */
  __IO uint32_t FHFLTRKC0_2;                       /**< Fault Reaction Set Configuration, offset: 0x1098 */
  __IO uint32_t FHFLTRKC0_3;                       /**< Fault Reaction Set Configuration, offset: 0x109C */
  __IO uint32_t FHFLTRKC0_4;                       /**< Fault Reaction Set Configuration, offset: 0x10A0 */
  __IO uint32_t FHFLTRKC0_5;                       /**< Fault Reaction Set Configuration, offset: 0x10A4 */
  __IO uint32_t FHFLTRKC0_6;                       /**< Fault Reaction Set Configuration, offset: 0x10A8 */
  __IO uint32_t FHFLTRKC0_7;                       /**< Fault Reaction Set Configuration, offset: 0x10AC */
  __IO uint32_t FHFLTRKC0_8;                       /**< Fault Reaction Set Configuration, offset: 0x10B0 */
  __IO uint32_t FHFLTRKC0_9;                       /**< Fault Reaction Set Configuration, offset: 0x10B4 */
  __IO uint32_t FHFLTRKC0_10;                      /**< Fault Reaction Set Configuration, offset: 0x10B8 */
  __IO uint32_t FHFLTRKC0_11;                      /**< Fault Reaction Set Configuration, offset: 0x10BC */
  __IO uint32_t FHFLTRKC0_12;                      /**< Fault Reaction Set Configuration, offset: 0x10C0 */
  __IO uint32_t FHFLTRKC0_13;                      /**< Fault Reaction Set Configuration, offset: 0x10C4 */
  __IO uint32_t FHFLTRKC0_14;                      /**< Fault Reaction Set Configuration, offset: 0x10C8 */
  __IO uint32_t FHFLTRKC0_15;                      /**< Fault Reaction Set Configuration, offset: 0x10CC */
  __IO uint32_t FHFLTRKC0_16;                      /**< Fault Reaction Set Configuration, offset: 0x10D0 */
  __IO uint32_t FHFLTRKC0_17;                      /**< Fault Reaction Set Configuration, offset: 0x10D4 */
  __IO uint32_t FHFLTRKC0_18;                      /**< Fault Reaction Set Configuration, offset: 0x10D8 */
  __IO uint32_t FHFLTRKC0_19;                      /**< Fault Reaction Set Configuration, offset: 0x10DC */
  __IO uint32_t FHFLTRKC0_20;                      /**< Fault Reaction Set Configuration, offset: 0x10E0 */
  __IO uint32_t FHFLTRKC0_21;                      /**< Fault Reaction Set Configuration, offset: 0x10E4 */
  __IO uint32_t FHFLTRKC0_22;                      /**< Fault Reaction Set Configuration, offset: 0x10E8 */
  __IO uint32_t FHFLTRKC0_23;                      /**< Fault Reaction Set Configuration, offset: 0x10EC */
  __IO uint32_t FHFLTRKC0_24;                      /**< Fault Reaction Set Configuration, offset: 0x10F0 */
  __IO uint32_t FHFLTRKC0_25;                      /**< Fault Reaction Set Configuration, offset: 0x10F4 */
  __IO uint32_t FHFLTRKC0_26;                      /**< Fault Reaction Set Configuration, offset: 0x10F8 */
  __IO uint32_t FHFLTRKC0_27;                      /**< Fault Reaction Set Configuration, offset: 0x10FC */
  __IO uint32_t FHFLTRKC0_28;                      /**< Fault Reaction Set Configuration, offset: 0x1100 */
  __IO uint32_t FHFLTRKC0_29;                      /**< Fault Reaction Set Configuration, offset: 0x1104 */
  __IO uint32_t FHFLTRKC0_30;                      /**< Fault Reaction Set Configuration, offset: 0x1108 */
  __IO uint32_t FHFLTRKC0_31;                      /**< Fault Reaction Set Configuration, offset: 0x110C */
  uint8_t RESERVED_8[384];
  __IO uint32_t FHIMRKC0_00;                       /**< Immediate Reaction Configuration, offset: 0x1290 */
  uint8_t RESERVED_9[28];
  __IO uint32_t FHIMRKC0_10;                       /**< Immediate Reaction Configuration, offset: 0x12B0 */
  uint8_t RESERVED_10[28];
  __IO uint32_t FHIMRKC0_20;                       /**< Immediate Reaction Configuration, offset: 0x12D0 */
  uint8_t RESERVED_11[28];
  __IO uint32_t FHIMRKC0_30;                       /**< Immediate Reaction Configuration, offset: 0x12F0 */
  uint8_t RESERVED_12[28];
  __IO uint32_t FHIMRKC0_40;                       /**< Immediate Reaction Configuration, offset: 0x1310 */
  uint8_t RESERVED_13[28];
  __IO uint32_t FHIMRKC0_50;                       /**< Immediate Reaction Configuration, offset: 0x1330 */
  uint8_t RESERVED_14[28];
  __IO uint32_t FHIMRKC0_60;                       /**< Immediate Reaction Configuration, offset: 0x1350 */
  uint8_t RESERVED_15[28];
  __IO uint32_t FHIMRKC0_70;                       /**< Immediate Reaction Configuration, offset: 0x1370 */
  uint8_t RESERVED_16[28];
  __IO uint32_t FHIMRKC0_80;                       /**< Immediate Reaction Configuration, offset: 0x1390 */
  uint8_t RESERVED_17[28];
  __IO uint32_t FHIMRKC0_90;                       /**< Immediate Reaction Configuration, offset: 0x13B0 */
  uint8_t RESERVED_18[28];
  __IO uint32_t FHIMRKC0_100;                      /**< Immediate Reaction Configuration, offset: 0x13D0 */
  uint8_t RESERVED_19[28];
  __IO uint32_t FHIMRKC0_110;                      /**< Immediate Reaction Configuration, offset: 0x13F0 */
  uint8_t RESERVED_20[28];
  __IO uint32_t FHIMRKC0_120;                      /**< Immediate Reaction Configuration, offset: 0x1410 */
  uint8_t RESERVED_21[28];
  __IO uint32_t FHIMRKC0_130;                      /**< Immediate Reaction Configuration, offset: 0x1430 */
  uint8_t RESERVED_22[28];
  __IO uint32_t FHIMRKC0_140;                      /**< Immediate Reaction Configuration, offset: 0x1450 */
  uint8_t RESERVED_23[28];
  __IO uint32_t FHIMRKC0_150;                      /**< Immediate Reaction Configuration, offset: 0x1470 */
} LPE_VFCCU_Type, *LPE_VFCCU_MemMapPtr;

