zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
/** Number of instances of the LPE_VFCCU module. */
#define LPE_VFCCU_INSTANCE_COUNT                 (1u)

/* LPE_VFCCU - Peripheral instance base addresses */
/** Peripheral LPE_VFCCU base address */
#define IP_LPE_VFCCU_BASE                        (0x42138000u)
/** Peripheral LPE_VFCCU base pointer */
#define IP_LPE_VFCCU                             ((LPE_VFCCU_Type *)IP_LPE_VFCCU_BASE)
/** Array initializer of LPE_VFCCU peripheral base addresses */
#define IP_LPE_VFCCU_BASE_ADDRS                  { IP_LPE_VFCCU_BASE }
/** Array initializer of LPE_VFCCU peripheral base pointers */
#define IP_LPE_VFCCU_BASE_PTRS                   { IP_LPE_VFCCU }

/* ----------------------------------------------------------------------------
   -- LPE_VFCCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPE_VFCCU_Register_Masks LPE_VFCCU Register Masks
 * @{
 */

/*! @name GFLTPO_C0 - Global Fault Polarity */
/*! @{ */

#define LPE_VFCCU_GFLTPO_C0_PS0_MASK             (0x1U)
#define LPE_VFCCU_GFLTPO_C0_PS0_SHIFT            (0U)
#define LPE_VFCCU_GFLTPO_C0_PS0_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS0(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS0_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS0_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS1_MASK             (0x2U)
#define LPE_VFCCU_GFLTPO_C0_PS1_SHIFT            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS1_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS1(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS1_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS1_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS2_MASK             (0x4U)
#define LPE_VFCCU_GFLTPO_C0_PS2_SHIFT            (2U)
#define LPE_VFCCU_GFLTPO_C0_PS2_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS2(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS2_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS2_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS3_MASK             (0x8U)
#define LPE_VFCCU_GFLTPO_C0_PS3_SHIFT            (3U)
#define LPE_VFCCU_GFLTPO_C0_PS3_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS3(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS3_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS3_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS4_MASK             (0x10U)
#define LPE_VFCCU_GFLTPO_C0_PS4_SHIFT            (4U)
#define LPE_VFCCU_GFLTPO_C0_PS4_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS4(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS4_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS4_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS5_MASK             (0x20U)
#define LPE_VFCCU_GFLTPO_C0_PS5_SHIFT            (5U)
#define LPE_VFCCU_GFLTPO_C0_PS5_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS5(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS5_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS5_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS6_MASK             (0x40U)
#define LPE_VFCCU_GFLTPO_C0_PS6_SHIFT            (6U)
#define LPE_VFCCU_GFLTPO_C0_PS6_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS6(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS6_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS6_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS7_MASK             (0x80U)
#define LPE_VFCCU_GFLTPO_C0_PS7_SHIFT            (7U)
#define LPE_VFCCU_GFLTPO_C0_PS7_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS7(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS7_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS7_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS8_MASK             (0x100U)
#define LPE_VFCCU_GFLTPO_C0_PS8_SHIFT            (8U)
#define LPE_VFCCU_GFLTPO_C0_PS8_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS8(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS8_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS8_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS9_MASK             (0x200U)
#define LPE_VFCCU_GFLTPO_C0_PS9_SHIFT            (9U)
#define LPE_VFCCU_GFLTPO_C0_PS9_WIDTH            (1U)
#define LPE_VFCCU_GFLTPO_C0_PS9(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS9_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS9_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS10_MASK            (0x400U)
#define LPE_VFCCU_GFLTPO_C0_PS10_SHIFT           (10U)
#define LPE_VFCCU_GFLTPO_C0_PS10_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS10(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS10_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS10_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS11_MASK            (0x800U)
#define LPE_VFCCU_GFLTPO_C0_PS11_SHIFT           (11U)
#define LPE_VFCCU_GFLTPO_C0_PS11_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS11(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS11_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS11_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS12_MASK            (0x1000U)
#define LPE_VFCCU_GFLTPO_C0_PS12_SHIFT           (12U)
#define LPE_VFCCU_GFLTPO_C0_PS12_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS12(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS12_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS12_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS13_MASK            (0x2000U)
#define LPE_VFCCU_GFLTPO_C0_PS13_SHIFT           (13U)
#define LPE_VFCCU_GFLTPO_C0_PS13_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS13(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS13_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS13_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS14_MASK            (0x4000U)
#define LPE_VFCCU_GFLTPO_C0_PS14_SHIFT           (14U)
#define LPE_VFCCU_GFLTPO_C0_PS14_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS14(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS14_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS14_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS15_MASK            (0x8000U)
#define LPE_VFCCU_GFLTPO_C0_PS15_SHIFT           (15U)
#define LPE_VFCCU_GFLTPO_C0_PS15_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS15(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS15_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS15_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS16_MASK            (0x10000U)
#define LPE_VFCCU_GFLTPO_C0_PS16_SHIFT           (16U)
#define LPE_VFCCU_GFLTPO_C0_PS16_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS16(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS16_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS16_MASK)

