zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTPO_C0_PS17_MASK            (0x20000U)
#define LPE_VFCCU_GFLTPO_C0_PS17_SHIFT           (17U)
#define LPE_VFCCU_GFLTPO_C0_PS17_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS17(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS17_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS17_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS18_MASK            (0x40000U)
#define LPE_VFCCU_GFLTPO_C0_PS18_SHIFT           (18U)
#define LPE_VFCCU_GFLTPO_C0_PS18_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS18(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS18_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS18_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS19_MASK            (0x80000U)
#define LPE_VFCCU_GFLTPO_C0_PS19_SHIFT           (19U)
#define LPE_VFCCU_GFLTPO_C0_PS19_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS19(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS19_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS19_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS20_MASK            (0x100000U)
#define LPE_VFCCU_GFLTPO_C0_PS20_SHIFT           (20U)
#define LPE_VFCCU_GFLTPO_C0_PS20_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS20(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS20_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS20_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS21_MASK            (0x200000U)
#define LPE_VFCCU_GFLTPO_C0_PS21_SHIFT           (21U)
#define LPE_VFCCU_GFLTPO_C0_PS21_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS21(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS21_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS21_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS22_MASK            (0x400000U)
#define LPE_VFCCU_GFLTPO_C0_PS22_SHIFT           (22U)
#define LPE_VFCCU_GFLTPO_C0_PS22_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS22(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS22_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS22_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS23_MASK            (0x800000U)
#define LPE_VFCCU_GFLTPO_C0_PS23_SHIFT           (23U)
#define LPE_VFCCU_GFLTPO_C0_PS23_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS23(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS23_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS23_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS24_MASK            (0x1000000U)
#define LPE_VFCCU_GFLTPO_C0_PS24_SHIFT           (24U)
#define LPE_VFCCU_GFLTPO_C0_PS24_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS24(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS24_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS24_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS25_MASK            (0x2000000U)
#define LPE_VFCCU_GFLTPO_C0_PS25_SHIFT           (25U)
#define LPE_VFCCU_GFLTPO_C0_PS25_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS25(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS25_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS25_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS26_MASK            (0x4000000U)
#define LPE_VFCCU_GFLTPO_C0_PS26_SHIFT           (26U)
#define LPE_VFCCU_GFLTPO_C0_PS26_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS26(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS26_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS26_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS27_MASK            (0x8000000U)
#define LPE_VFCCU_GFLTPO_C0_PS27_SHIFT           (27U)
#define LPE_VFCCU_GFLTPO_C0_PS27_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS27(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS27_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS27_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS28_MASK            (0x10000000U)
#define LPE_VFCCU_GFLTPO_C0_PS28_SHIFT           (28U)
#define LPE_VFCCU_GFLTPO_C0_PS28_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS28(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS28_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS28_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS29_MASK            (0x20000000U)
#define LPE_VFCCU_GFLTPO_C0_PS29_SHIFT           (29U)
#define LPE_VFCCU_GFLTPO_C0_PS29_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS29(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS29_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS29_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS30_MASK            (0x40000000U)
#define LPE_VFCCU_GFLTPO_C0_PS30_SHIFT           (30U)
#define LPE_VFCCU_GFLTPO_C0_PS30_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS30(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS30_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS30_MASK)

#define LPE_VFCCU_GFLTPO_C0_PS31_MASK            (0x80000000U)
#define LPE_VFCCU_GFLTPO_C0_PS31_SHIFT           (31U)
#define LPE_VFCCU_GFLTPO_C0_PS31_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C0_PS31(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C0_PS31_SHIFT)) & LPE_VFCCU_GFLTPO_C0_PS31_MASK)
/*! @} */

/*! @name GFLTPO_C1 - Global Fault Polarity */
/*! @{ */

#define LPE_VFCCU_GFLTPO_C1_PS32_MASK            (0x1U)
#define LPE_VFCCU_GFLTPO_C1_PS32_SHIFT           (0U)
#define LPE_VFCCU_GFLTPO_C1_PS32_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS32(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS32_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS32_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS33_MASK            (0x2U)
#define LPE_VFCCU_GFLTPO_C1_PS33_SHIFT           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS33_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS33(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS33_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS33_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS34_MASK            (0x4U)
#define LPE_VFCCU_GFLTPO_C1_PS34_SHIFT           (2U)
#define LPE_VFCCU_GFLTPO_C1_PS34_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS34(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS34_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS34_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS35_MASK            (0x8U)
#define LPE_VFCCU_GFLTPO_C1_PS35_SHIFT           (3U)
#define LPE_VFCCU_GFLTPO_C1_PS35_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS35(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS35_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS35_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS36_MASK            (0x10U)
#define LPE_VFCCU_GFLTPO_C1_PS36_SHIFT           (4U)
#define LPE_VFCCU_GFLTPO_C1_PS36_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS36(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS36_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS36_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS37_MASK            (0x20U)
#define LPE_VFCCU_GFLTPO_C1_PS37_SHIFT           (5U)
#define LPE_VFCCU_GFLTPO_C1_PS37_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS37(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS37_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS37_MASK)

