zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTPO_C1_PS38_MASK            (0x40U)
#define LPE_VFCCU_GFLTPO_C1_PS38_SHIFT           (6U)
#define LPE_VFCCU_GFLTPO_C1_PS38_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS38(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS38_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS38_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS39_MASK            (0x80U)
#define LPE_VFCCU_GFLTPO_C1_PS39_SHIFT           (7U)
#define LPE_VFCCU_GFLTPO_C1_PS39_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS39(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS39_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS39_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS40_MASK            (0x100U)
#define LPE_VFCCU_GFLTPO_C1_PS40_SHIFT           (8U)
#define LPE_VFCCU_GFLTPO_C1_PS40_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS40(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS40_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS40_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS41_MASK            (0x200U)
#define LPE_VFCCU_GFLTPO_C1_PS41_SHIFT           (9U)
#define LPE_VFCCU_GFLTPO_C1_PS41_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS41(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS41_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS41_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS42_MASK            (0x400U)
#define LPE_VFCCU_GFLTPO_C1_PS42_SHIFT           (10U)
#define LPE_VFCCU_GFLTPO_C1_PS42_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS42(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS42_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS42_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS43_MASK            (0x800U)
#define LPE_VFCCU_GFLTPO_C1_PS43_SHIFT           (11U)
#define LPE_VFCCU_GFLTPO_C1_PS43_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS43(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS43_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS43_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS44_MASK            (0x1000U)
#define LPE_VFCCU_GFLTPO_C1_PS44_SHIFT           (12U)
#define LPE_VFCCU_GFLTPO_C1_PS44_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS44(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS44_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS44_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS45_MASK            (0x2000U)
#define LPE_VFCCU_GFLTPO_C1_PS45_SHIFT           (13U)
#define LPE_VFCCU_GFLTPO_C1_PS45_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS45(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS45_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS45_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS46_MASK            (0x4000U)
#define LPE_VFCCU_GFLTPO_C1_PS46_SHIFT           (14U)
#define LPE_VFCCU_GFLTPO_C1_PS46_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS46(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS46_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS46_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS47_MASK            (0x8000U)
#define LPE_VFCCU_GFLTPO_C1_PS47_SHIFT           (15U)
#define LPE_VFCCU_GFLTPO_C1_PS47_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS47(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS47_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS47_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS48_MASK            (0x10000U)
#define LPE_VFCCU_GFLTPO_C1_PS48_SHIFT           (16U)
#define LPE_VFCCU_GFLTPO_C1_PS48_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS48(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS48_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS48_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS49_MASK            (0x20000U)
#define LPE_VFCCU_GFLTPO_C1_PS49_SHIFT           (17U)
#define LPE_VFCCU_GFLTPO_C1_PS49_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS49(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS49_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS49_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS50_MASK            (0x40000U)
#define LPE_VFCCU_GFLTPO_C1_PS50_SHIFT           (18U)
#define LPE_VFCCU_GFLTPO_C1_PS50_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS50(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS50_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS50_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS51_MASK            (0x80000U)
#define LPE_VFCCU_GFLTPO_C1_PS51_SHIFT           (19U)
#define LPE_VFCCU_GFLTPO_C1_PS51_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS51(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS51_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS51_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS52_MASK            (0x100000U)
#define LPE_VFCCU_GFLTPO_C1_PS52_SHIFT           (20U)
#define LPE_VFCCU_GFLTPO_C1_PS52_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS52(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS52_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS52_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS53_MASK            (0x200000U)
#define LPE_VFCCU_GFLTPO_C1_PS53_SHIFT           (21U)
#define LPE_VFCCU_GFLTPO_C1_PS53_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS53(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS53_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS53_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS54_MASK            (0x400000U)
#define LPE_VFCCU_GFLTPO_C1_PS54_SHIFT           (22U)
#define LPE_VFCCU_GFLTPO_C1_PS54_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS54(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS54_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS54_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS55_MASK            (0x800000U)
#define LPE_VFCCU_GFLTPO_C1_PS55_SHIFT           (23U)
#define LPE_VFCCU_GFLTPO_C1_PS55_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS55(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS55_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS55_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS56_MASK            (0x1000000U)
#define LPE_VFCCU_GFLTPO_C1_PS56_SHIFT           (24U)
#define LPE_VFCCU_GFLTPO_C1_PS56_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS56(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS56_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS56_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS57_MASK            (0x2000000U)
#define LPE_VFCCU_GFLTPO_C1_PS57_SHIFT           (25U)
#define LPE_VFCCU_GFLTPO_C1_PS57_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS57(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS57_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS57_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS58_MASK            (0x4000000U)
#define LPE_VFCCU_GFLTPO_C1_PS58_SHIFT           (26U)
#define LPE_VFCCU_GFLTPO_C1_PS58_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS58(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS58_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS58_MASK)

#define LPE_VFCCU_GFLTPO_C1_PS59_MASK            (0x8000000U)
#define LPE_VFCCU_GFLTPO_C1_PS59_SHIFT           (27U)
#define LPE_VFCCU_GFLTPO_C1_PS59_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C1_PS59(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C1_PS59_SHIFT)) & LPE_VFCCU_GFLTPO_C1_PS59_MASK)

