zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTPO_C2_PS85_MASK            (0x200000U)
#define LPE_VFCCU_GFLTPO_C2_PS85_SHIFT           (21U)
#define LPE_VFCCU_GFLTPO_C2_PS85_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS85(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS85_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS85_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS86_MASK            (0x400000U)
#define LPE_VFCCU_GFLTPO_C2_PS86_SHIFT           (22U)
#define LPE_VFCCU_GFLTPO_C2_PS86_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS86(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS86_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS86_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS87_MASK            (0x800000U)
#define LPE_VFCCU_GFLTPO_C2_PS87_SHIFT           (23U)
#define LPE_VFCCU_GFLTPO_C2_PS87_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS87(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS87_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS87_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS88_MASK            (0x1000000U)
#define LPE_VFCCU_GFLTPO_C2_PS88_SHIFT           (24U)
#define LPE_VFCCU_GFLTPO_C2_PS88_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS88(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS88_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS88_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS89_MASK            (0x2000000U)
#define LPE_VFCCU_GFLTPO_C2_PS89_SHIFT           (25U)
#define LPE_VFCCU_GFLTPO_C2_PS89_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS89(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS89_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS89_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS90_MASK            (0x4000000U)
#define LPE_VFCCU_GFLTPO_C2_PS90_SHIFT           (26U)
#define LPE_VFCCU_GFLTPO_C2_PS90_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS90(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS90_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS90_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS91_MASK            (0x8000000U)
#define LPE_VFCCU_GFLTPO_C2_PS91_SHIFT           (27U)
#define LPE_VFCCU_GFLTPO_C2_PS91_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS91(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS91_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS91_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS92_MASK            (0x10000000U)
#define LPE_VFCCU_GFLTPO_C2_PS92_SHIFT           (28U)
#define LPE_VFCCU_GFLTPO_C2_PS92_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS92(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS92_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS92_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS93_MASK            (0x20000000U)
#define LPE_VFCCU_GFLTPO_C2_PS93_SHIFT           (29U)
#define LPE_VFCCU_GFLTPO_C2_PS93_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS93(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS93_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS93_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS94_MASK            (0x40000000U)
#define LPE_VFCCU_GFLTPO_C2_PS94_SHIFT           (30U)
#define LPE_VFCCU_GFLTPO_C2_PS94_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS94(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS94_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS94_MASK)

#define LPE_VFCCU_GFLTPO_C2_PS95_MASK            (0x80000000U)
#define LPE_VFCCU_GFLTPO_C2_PS95_SHIFT           (31U)
#define LPE_VFCCU_GFLTPO_C2_PS95_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C2_PS95(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C2_PS95_SHIFT)) & LPE_VFCCU_GFLTPO_C2_PS95_MASK)
/*! @} */

/*! @name GFLTPO_C3 - Global Fault Polarity */
/*! @{ */

#define LPE_VFCCU_GFLTPO_C3_PS96_MASK            (0x1U)
#define LPE_VFCCU_GFLTPO_C3_PS96_SHIFT           (0U)
#define LPE_VFCCU_GFLTPO_C3_PS96_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C3_PS96(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS96_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS96_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS97_MASK            (0x2U)
#define LPE_VFCCU_GFLTPO_C3_PS97_SHIFT           (1U)
#define LPE_VFCCU_GFLTPO_C3_PS97_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C3_PS97(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS97_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS97_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS98_MASK            (0x4U)
#define LPE_VFCCU_GFLTPO_C3_PS98_SHIFT           (2U)
#define LPE_VFCCU_GFLTPO_C3_PS98_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C3_PS98(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS98_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS98_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS99_MASK            (0x8U)
#define LPE_VFCCU_GFLTPO_C3_PS99_SHIFT           (3U)
#define LPE_VFCCU_GFLTPO_C3_PS99_WIDTH           (1U)
#define LPE_VFCCU_GFLTPO_C3_PS99(x)              (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS99_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS99_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS100_MASK           (0x10U)
#define LPE_VFCCU_GFLTPO_C3_PS100_SHIFT          (4U)
#define LPE_VFCCU_GFLTPO_C3_PS100_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS100(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS100_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS100_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS101_MASK           (0x20U)
#define LPE_VFCCU_GFLTPO_C3_PS101_SHIFT          (5U)
#define LPE_VFCCU_GFLTPO_C3_PS101_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS101(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS101_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS101_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS102_MASK           (0x40U)
#define LPE_VFCCU_GFLTPO_C3_PS102_SHIFT          (6U)
#define LPE_VFCCU_GFLTPO_C3_PS102_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS102(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS102_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS102_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS103_MASK           (0x80U)
#define LPE_VFCCU_GFLTPO_C3_PS103_SHIFT          (7U)
#define LPE_VFCCU_GFLTPO_C3_PS103_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS103(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS103_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS103_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS104_MASK           (0x100U)
#define LPE_VFCCU_GFLTPO_C3_PS104_SHIFT          (8U)
#define LPE_VFCCU_GFLTPO_C3_PS104_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS104(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS104_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS104_MASK)

