zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTPO_C3_PS105_MASK           (0x200U)
#define LPE_VFCCU_GFLTPO_C3_PS105_SHIFT          (9U)
#define LPE_VFCCU_GFLTPO_C3_PS105_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS105(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS105_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS105_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS106_MASK           (0x400U)
#define LPE_VFCCU_GFLTPO_C3_PS106_SHIFT          (10U)
#define LPE_VFCCU_GFLTPO_C3_PS106_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS106(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS106_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS106_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS107_MASK           (0x800U)
#define LPE_VFCCU_GFLTPO_C3_PS107_SHIFT          (11U)
#define LPE_VFCCU_GFLTPO_C3_PS107_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS107(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS107_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS107_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS108_MASK           (0x1000U)
#define LPE_VFCCU_GFLTPO_C3_PS108_SHIFT          (12U)
#define LPE_VFCCU_GFLTPO_C3_PS108_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS108(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS108_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS108_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS109_MASK           (0x2000U)
#define LPE_VFCCU_GFLTPO_C3_PS109_SHIFT          (13U)
#define LPE_VFCCU_GFLTPO_C3_PS109_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS109(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS109_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS109_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS110_MASK           (0x4000U)
#define LPE_VFCCU_GFLTPO_C3_PS110_SHIFT          (14U)
#define LPE_VFCCU_GFLTPO_C3_PS110_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS110(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS110_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS110_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS111_MASK           (0x8000U)
#define LPE_VFCCU_GFLTPO_C3_PS111_SHIFT          (15U)
#define LPE_VFCCU_GFLTPO_C3_PS111_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS111(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS111_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS111_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS112_MASK           (0x10000U)
#define LPE_VFCCU_GFLTPO_C3_PS112_SHIFT          (16U)
#define LPE_VFCCU_GFLTPO_C3_PS112_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS112(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS112_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS112_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS113_MASK           (0x20000U)
#define LPE_VFCCU_GFLTPO_C3_PS113_SHIFT          (17U)
#define LPE_VFCCU_GFLTPO_C3_PS113_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS113(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS113_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS113_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS114_MASK           (0x40000U)
#define LPE_VFCCU_GFLTPO_C3_PS114_SHIFT          (18U)
#define LPE_VFCCU_GFLTPO_C3_PS114_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS114(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS114_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS114_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS115_MASK           (0x80000U)
#define LPE_VFCCU_GFLTPO_C3_PS115_SHIFT          (19U)
#define LPE_VFCCU_GFLTPO_C3_PS115_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS115(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS115_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS115_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS116_MASK           (0x100000U)
#define LPE_VFCCU_GFLTPO_C3_PS116_SHIFT          (20U)
#define LPE_VFCCU_GFLTPO_C3_PS116_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS116(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS116_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS116_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS117_MASK           (0x200000U)
#define LPE_VFCCU_GFLTPO_C3_PS117_SHIFT          (21U)
#define LPE_VFCCU_GFLTPO_C3_PS117_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS117(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS117_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS117_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS118_MASK           (0x400000U)
#define LPE_VFCCU_GFLTPO_C3_PS118_SHIFT          (22U)
#define LPE_VFCCU_GFLTPO_C3_PS118_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS118(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS118_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS118_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS119_MASK           (0x800000U)
#define LPE_VFCCU_GFLTPO_C3_PS119_SHIFT          (23U)
#define LPE_VFCCU_GFLTPO_C3_PS119_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS119(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS119_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS119_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS120_MASK           (0x1000000U)
#define LPE_VFCCU_GFLTPO_C3_PS120_SHIFT          (24U)
#define LPE_VFCCU_GFLTPO_C3_PS120_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS120(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS120_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS120_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS121_MASK           (0x2000000U)
#define LPE_VFCCU_GFLTPO_C3_PS121_SHIFT          (25U)
#define LPE_VFCCU_GFLTPO_C3_PS121_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS121(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS121_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS121_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS122_MASK           (0x4000000U)
#define LPE_VFCCU_GFLTPO_C3_PS122_SHIFT          (26U)
#define LPE_VFCCU_GFLTPO_C3_PS122_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS122(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS122_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS122_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS123_MASK           (0x8000000U)
#define LPE_VFCCU_GFLTPO_C3_PS123_SHIFT          (27U)
#define LPE_VFCCU_GFLTPO_C3_PS123_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS123(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS123_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS123_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS124_MASK           (0x10000000U)
#define LPE_VFCCU_GFLTPO_C3_PS124_SHIFT          (28U)
#define LPE_VFCCU_GFLTPO_C3_PS124_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS124(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS124_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS124_MASK)

