zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTPO_C3_PS125_MASK           (0x20000000U)
#define LPE_VFCCU_GFLTPO_C3_PS125_SHIFT          (29U)
#define LPE_VFCCU_GFLTPO_C3_PS125_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS125(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS125_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS125_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS126_MASK           (0x40000000U)
#define LPE_VFCCU_GFLTPO_C3_PS126_SHIFT          (30U)
#define LPE_VFCCU_GFLTPO_C3_PS126_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS126(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS126_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS126_MASK)

#define LPE_VFCCU_GFLTPO_C3_PS127_MASK           (0x80000000U)
#define LPE_VFCCU_GFLTPO_C3_PS127_SHIFT          (31U)
#define LPE_VFCCU_GFLTPO_C3_PS127_WIDTH          (1U)
#define LPE_VFCCU_GFLTPO_C3_PS127(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTPO_C3_PS127_SHIFT)) & LPE_VFCCU_GFLTPO_C3_PS127_MASK)
/*! @} */

/*! @name GFLTRC_C0 - Global Fault Recovery */
/*! @{ */

#define LPE_VFCCU_GFLTRC_C0_RHWSW0_MASK          (0x1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW0_SHIFT         (0U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW0_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW0(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW0_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW0_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW1_MASK          (0x2U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW1_SHIFT         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW1_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW1(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW1_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW1_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW2_MASK          (0x4U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW2_SHIFT         (2U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW2_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW2(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW2_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW2_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW3_MASK          (0x8U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW3_SHIFT         (3U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW3_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW3(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW3_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW3_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW4_MASK          (0x10U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW4_SHIFT         (4U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW4_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW4(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW4_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW4_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW5_MASK          (0x20U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW5_SHIFT         (5U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW5_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW5(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW5_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW5_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW6_MASK          (0x40U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW6_SHIFT         (6U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW6_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW6(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW6_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW6_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW7_MASK          (0x80U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW7_SHIFT         (7U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW7_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW7(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW7_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW7_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW8_MASK          (0x100U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW8_SHIFT         (8U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW8_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW8(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW8_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW8_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW9_MASK          (0x200U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW9_SHIFT         (9U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW9_WIDTH         (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW9(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW9_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW9_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW10_MASK         (0x400U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW10_SHIFT        (10U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW10_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW10(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW10_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW10_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW11_MASK         (0x800U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW11_SHIFT        (11U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW11_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW11(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW11_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW11_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW12_MASK         (0x1000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW12_SHIFT        (12U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW12_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW12(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW12_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW12_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW13_MASK         (0x2000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW13_SHIFT        (13U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW13_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW13(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW13_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW13_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW14_MASK         (0x4000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW14_SHIFT        (14U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW14_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW14(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW14_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW14_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW15_MASK         (0x8000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW15_SHIFT        (15U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW15_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW15(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW15_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW15_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW16_MASK         (0x10000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW16_SHIFT        (16U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW16_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW16(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW16_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW16_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW17_MASK         (0x20000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW17_SHIFT        (17U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW17_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW17(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW17_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW17_MASK)

