zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTRC_C0_RHWSW18_MASK         (0x40000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW18_SHIFT        (18U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW18_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW18(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW18_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW18_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW19_MASK         (0x80000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW19_SHIFT        (19U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW19_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW19(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW19_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW19_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW20_MASK         (0x100000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW20_SHIFT        (20U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW20_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW20(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW20_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW20_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW21_MASK         (0x200000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW21_SHIFT        (21U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW21_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW21(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW21_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW21_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW22_MASK         (0x400000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW22_SHIFT        (22U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW22_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW22(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW22_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW22_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW23_MASK         (0x800000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW23_SHIFT        (23U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW23_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW23(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW23_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW23_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW24_MASK         (0x1000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW24_SHIFT        (24U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW24_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW24(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW24_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW24_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW25_MASK         (0x2000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW25_SHIFT        (25U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW25_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW25(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW25_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW25_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW26_MASK         (0x4000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW26_SHIFT        (26U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW26_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW26(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW26_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW26_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW27_MASK         (0x8000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW27_SHIFT        (27U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW27_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW27(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW27_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW27_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW28_MASK         (0x10000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW28_SHIFT        (28U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW28_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW28(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW28_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW28_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW29_MASK         (0x20000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW29_SHIFT        (29U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW29_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW29(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW29_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW29_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW30_MASK         (0x40000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW30_SHIFT        (30U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW30_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW30(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW30_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW30_MASK)

#define LPE_VFCCU_GFLTRC_C0_RHWSW31_MASK         (0x80000000U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW31_SHIFT        (31U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW31_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C0_RHWSW31(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C0_RHWSW31_SHIFT)) & LPE_VFCCU_GFLTRC_C0_RHWSW31_MASK)
/*! @} */

/*! @name GFLTRC_C1 - Global Fault Recovery */
/*! @{ */

#define LPE_VFCCU_GFLTRC_C1_RHWSW32_MASK         (0x1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW32_SHIFT        (0U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW32_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW32(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW32_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW32_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW33_MASK         (0x2U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW33_SHIFT        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW33_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW33(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW33_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW33_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW34_MASK         (0x4U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW34_SHIFT        (2U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW34_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW34(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW34_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW34_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW35_MASK         (0x8U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW35_SHIFT        (3U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW35_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW35(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW35_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW35_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW36_MASK         (0x10U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW36_SHIFT        (4U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW36_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW36(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW36_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW36_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW37_MASK         (0x20U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW37_SHIFT        (5U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW37_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW37(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW37_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW37_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW38_MASK         (0x40U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW38_SHIFT        (6U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW38_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW38(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW38_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW38_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW39_MASK         (0x80U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW39_SHIFT        (7U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW39_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW39(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW39_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW39_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW40_MASK         (0x100U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW40_SHIFT        (8U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW40_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW40(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW40_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW40_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW41_MASK         (0x200U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW41_SHIFT        (9U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW41_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW41(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW41_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW41_MASK)

