zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTRC_C1_RHWSW42_MASK         (0x400U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW42_SHIFT        (10U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW42_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW42(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW42_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW42_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW43_MASK         (0x800U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW43_SHIFT        (11U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW43_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW43(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW43_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW43_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW44_MASK         (0x1000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW44_SHIFT        (12U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW44_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW44(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW44_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW44_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW45_MASK         (0x2000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW45_SHIFT        (13U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW45_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW45(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW45_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW45_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW46_MASK         (0x4000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW46_SHIFT        (14U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW46_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW46(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW46_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW46_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW47_MASK         (0x8000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW47_SHIFT        (15U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW47_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW47(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW47_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW47_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW48_MASK         (0x10000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW48_SHIFT        (16U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW48_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW48(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW48_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW48_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW49_MASK         (0x20000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW49_SHIFT        (17U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW49_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW49(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW49_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW49_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW50_MASK         (0x40000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW50_SHIFT        (18U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW50_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW50(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW50_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW50_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW51_MASK         (0x80000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW51_SHIFT        (19U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW51_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW51(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW51_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW51_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW52_MASK         (0x100000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW52_SHIFT        (20U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW52_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW52(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW52_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW52_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW53_MASK         (0x200000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW53_SHIFT        (21U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW53_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW53(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW53_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW53_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW54_MASK         (0x400000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW54_SHIFT        (22U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW54_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW54(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW54_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW54_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW55_MASK         (0x800000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW55_SHIFT        (23U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW55_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW55(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW55_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW55_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW56_MASK         (0x1000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW56_SHIFT        (24U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW56_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW56(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW56_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW56_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW57_MASK         (0x2000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW57_SHIFT        (25U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW57_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW57(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW57_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW57_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW58_MASK         (0x4000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW58_SHIFT        (26U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW58_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW58(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW58_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW58_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW59_MASK         (0x8000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW59_SHIFT        (27U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW59_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW59(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW59_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW59_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW60_MASK         (0x10000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW60_SHIFT        (28U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW60_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW60(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW60_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW60_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW61_MASK         (0x20000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW61_SHIFT        (29U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW61_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW61(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW61_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW61_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW62_MASK         (0x40000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW62_SHIFT        (30U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW62_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW62(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW62_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW62_MASK)

#define LPE_VFCCU_GFLTRC_C1_RHWSW63_MASK         (0x80000000U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW63_SHIFT        (31U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW63_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C1_RHWSW63(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C1_RHWSW63_SHIFT)) & LPE_VFCCU_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GFLTRC_C2 - Global Fault Recovery */
/*! @{ */

#define LPE_VFCCU_GFLTRC_C2_RHWSW64_MASK         (0x1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW64_SHIFT        (0U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW64_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW64(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW64_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW64_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW65_MASK         (0x2U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW65_SHIFT        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW65_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW65(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW65_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW65_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW66_MASK         (0x4U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW66_SHIFT        (2U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW66_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW66(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW66_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW66_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW67_MASK         (0x8U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW67_SHIFT        (3U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW67_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW67(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW67_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW67_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW68_MASK         (0x10U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW68_SHIFT        (4U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW68_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW68(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW68_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW68_MASK)

