zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTRC_C2_RHWSW69_MASK         (0x20U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW69_SHIFT        (5U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW69_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW69(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW69_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW69_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW70_MASK         (0x40U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW70_SHIFT        (6U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW70_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW70(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW70_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW70_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW71_MASK         (0x80U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW71_SHIFT        (7U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW71_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW71(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW71_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW71_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW72_MASK         (0x100U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW72_SHIFT        (8U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW72_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW72(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW72_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW72_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW73_MASK         (0x200U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW73_SHIFT        (9U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW73_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW73(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW73_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW73_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW74_MASK         (0x400U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW74_SHIFT        (10U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW74_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW74(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW74_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW74_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW75_MASK         (0x800U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW75_SHIFT        (11U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW75_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW75(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW75_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW75_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW76_MASK         (0x1000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW76_SHIFT        (12U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW76_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW76(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW76_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW76_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW77_MASK         (0x2000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW77_SHIFT        (13U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW77_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW77(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW77_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW77_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW78_MASK         (0x4000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW78_SHIFT        (14U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW78_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW78(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW78_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW78_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW79_MASK         (0x8000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW79_SHIFT        (15U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW79_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW79(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW79_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW79_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW80_MASK         (0x10000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW80_SHIFT        (16U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW80_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW80(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW80_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW80_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW81_MASK         (0x20000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW81_SHIFT        (17U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW81_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW81(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW81_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW81_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW82_MASK         (0x40000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW82_SHIFT        (18U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW82_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW82(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW82_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW82_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW83_MASK         (0x80000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW83_SHIFT        (19U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW83_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW83(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW83_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW83_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW84_MASK         (0x100000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW84_SHIFT        (20U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW84_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW84(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW84_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW84_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW85_MASK         (0x200000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW85_SHIFT        (21U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW85_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW85(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW85_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW85_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW86_MASK         (0x400000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW86_SHIFT        (22U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW86_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW86(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW86_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW86_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW87_MASK         (0x800000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW87_SHIFT        (23U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW87_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW87(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW87_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW87_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW88_MASK         (0x1000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW88_SHIFT        (24U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW88_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW88(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW88_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW88_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW89_MASK         (0x2000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW89_SHIFT        (25U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW89_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW89(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW89_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW89_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW90_MASK         (0x4000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW90_SHIFT        (26U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW90_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW90(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW90_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW90_MASK)

