zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTRC_C2_RHWSW91_MASK         (0x8000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW91_SHIFT        (27U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW91_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW91(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW91_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW91_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW92_MASK         (0x10000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW92_SHIFT        (28U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW92_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW92(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW92_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW92_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW93_MASK         (0x20000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW93_SHIFT        (29U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW93_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW93(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW93_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW93_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW94_MASK         (0x40000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW94_SHIFT        (30U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW94_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW94(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW94_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW94_MASK)

#define LPE_VFCCU_GFLTRC_C2_RHWSW95_MASK         (0x80000000U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW95_SHIFT        (31U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW95_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C2_RHWSW95(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C2_RHWSW95_SHIFT)) & LPE_VFCCU_GFLTRC_C2_RHWSW95_MASK)
/*! @} */

/*! @name GFLTRC_C3 - Global Fault Recovery */
/*! @{ */

#define LPE_VFCCU_GFLTRC_C3_RHWSW96_MASK         (0x1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW96_SHIFT        (0U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW96_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW96(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW96_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW96_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW97_MASK         (0x2U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW97_SHIFT        (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW97_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW97(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW97_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW97_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW98_MASK         (0x4U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW98_SHIFT        (2U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW98_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW98(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW98_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW98_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW99_MASK         (0x8U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW99_SHIFT        (3U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW99_WIDTH        (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW99(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW99_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW99_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW100_MASK        (0x10U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW100_SHIFT       (4U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW100_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW100(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW100_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW100_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW101_MASK        (0x20U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW101_SHIFT       (5U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW101_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW101(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW101_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW101_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW102_MASK        (0x40U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW102_SHIFT       (6U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW102_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW102(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW102_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW102_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW103_MASK        (0x80U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW103_SHIFT       (7U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW103_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW103(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW103_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW103_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW104_MASK        (0x100U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW104_SHIFT       (8U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW104_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW104(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW104_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW104_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW105_MASK        (0x200U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW105_SHIFT       (9U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW105_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW105(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW105_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW105_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW106_MASK        (0x400U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW106_SHIFT       (10U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW106_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW106(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW106_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW106_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW107_MASK        (0x800U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW107_SHIFT       (11U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW107_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW107(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW107_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW107_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW108_MASK        (0x1000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW108_SHIFT       (12U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW108_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW108(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW108_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW108_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW109_MASK        (0x2000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW109_SHIFT       (13U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW109_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW109(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW109_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW109_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW110_MASK        (0x4000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW110_SHIFT       (14U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW110_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW110(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW110_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW110_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW111_MASK        (0x8000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW111_SHIFT       (15U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW111_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW111(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW111_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW111_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW112_MASK        (0x10000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW112_SHIFT       (16U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW112_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW112(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW112_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW112_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW113_MASK        (0x20000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW113_SHIFT       (17U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW113_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW113(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW113_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW113_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW114_MASK        (0x40000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW114_SHIFT       (18U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW114_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW114(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW114_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW114_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW115_MASK        (0x80000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW115_SHIFT       (19U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW115_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW115(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW115_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW115_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW116_MASK        (0x100000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW116_SHIFT       (20U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW116_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW116(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW116_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW116_MASK)

