zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_GFLTRC_C3_RHWSW117_MASK        (0x200000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW117_SHIFT       (21U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW117_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW117(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW117_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW117_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW118_MASK        (0x400000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW118_SHIFT       (22U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW118_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW118(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW118_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW118_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW119_MASK        (0x800000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW119_SHIFT       (23U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW119_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW119(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW119_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW119_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW120_MASK        (0x1000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW120_SHIFT       (24U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW120_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW120(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW120_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW120_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW121_MASK        (0x2000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW121_SHIFT       (25U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW121_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW121(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW121_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW121_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW122_MASK        (0x4000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW122_SHIFT       (26U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW122_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW122(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW122_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW122_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW123_MASK        (0x8000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW123_SHIFT       (27U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW123_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW123(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW123_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW123_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW124_MASK        (0x10000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW124_SHIFT       (28U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW124_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW124(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW124_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW124_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW125_MASK        (0x20000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW125_SHIFT       (29U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW125_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW125(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW125_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW125_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW126_MASK        (0x40000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW126_SHIFT       (30U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW126_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW126(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW126_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW126_MASK)

#define LPE_VFCCU_GFLTRC_C3_RHWSW127_MASK        (0x80000000U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW127_SHIFT       (31U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW127_WIDTH       (1U)
#define LPE_VFCCU_GFLTRC_C3_RHWSW127(x)          (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GFLTRC_C3_RHWSW127_SHIFT)) & LPE_VFCCU_GFLTRC_C3_RHWSW127_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define LPE_VFCCU_GINTOVFS_FLTSERV_MASK          (0x80U)
#define LPE_VFCCU_GINTOVFS_FLTSERV_SHIFT         (7U)
#define LPE_VFCCU_GINTOVFS_FLTSERV_WIDTH         (1U)
#define LPE_VFCCU_GINTOVFS_FLTSERV(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GINTOVFS_FLTSERV_SHIFT)) & LPE_VFCCU_GINTOVFS_FLTSERV_MASK)

#define LPE_VFCCU_GINTOVFS_SERV_DID_MASK         (0xF0000U)
#define LPE_VFCCU_GINTOVFS_SERV_DID_SHIFT        (16U)
#define LPE_VFCCU_GINTOVFS_SERV_DID_WIDTH        (4U)
#define LPE_VFCCU_GINTOVFS_SERV_DID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GINTOVFS_SERV_DID_SHIFT)) & LPE_VFCCU_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GDBGCFG - Global Debug */
/*! @{ */

#define LPE_VFCCU_GDBGCFG_FRZ_MASK               (0x10000U)
#define LPE_VFCCU_GDBGCFG_FRZ_SHIFT              (16U)
#define LPE_VFCCU_GDBGCFG_FRZ_WIDTH              (1U)
#define LPE_VFCCU_GDBGCFG_FRZ(x)                 (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GDBGCFG_FRZ_SHIFT)) & LPE_VFCCU_GDBGCFG_FRZ_MASK)
/*! @} */

/*! @name GDBGSTAT - Global Debug Status */
/*! @{ */

#define LPE_VFCCU_GDBGSTAT_FLTIND_MASK           (0xFFU)
#define LPE_VFCCU_GDBGSTAT_FLTIND_SHIFT          (0U)
#define LPE_VFCCU_GDBGSTAT_FLTIND_WIDTH          (8U)
#define LPE_VFCCU_GDBGSTAT_FLTIND(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GDBGSTAT_FLTIND_SHIFT)) & LPE_VFCCU_GDBGSTAT_FLTIND_MASK)

#define LPE_VFCCU_GDBGSTAT_RKN_ACK_MASK          (0x40000000U)
#define LPE_VFCCU_GDBGSTAT_RKN_ACK_SHIFT         (30U)
#define LPE_VFCCU_GDBGSTAT_RKN_ACK_WIDTH         (1U)
#define LPE_VFCCU_GDBGSTAT_RKN_ACK(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GDBGSTAT_RKN_ACK_SHIFT)) & LPE_VFCCU_GDBGSTAT_RKN_ACK_MASK)

#define LPE_VFCCU_GDBGSTAT_RKN_REQ_MASK          (0x80000000U)
#define LPE_VFCCU_GDBGSTAT_RKN_REQ_SHIFT         (31U)
#define LPE_VFCCU_GDBGSTAT_RKN_REQ_WIDTH         (1U)
#define LPE_VFCCU_GDBGSTAT_RKN_REQ(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_GDBGSTAT_RKN_REQ_SHIFT)) & LPE_VFCCU_GDBGSTAT_RKN_REQ_MASK)
/*! @} */

/*! @name FHCFG0 - Fault Handler */
/*! @{ */

#define LPE_VFCCU_FHCFG0_FHIDEN_MASK             (0x1U)
#define LPE_VFCCU_FHCFG0_FHIDEN_SHIFT            (0U)
#define LPE_VFCCU_FHCFG0_FHIDEN_WIDTH            (1U)
#define LPE_VFCCU_FHCFG0_FHIDEN(x)               (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHCFG0_FHIDEN_SHIFT)) & LPE_VFCCU_FHCFG0_FHIDEN_MASK)
/*! @} */

/*! @name FHSRVDS0 - Fault Handler Status */
/*! @{ */

#define LPE_VFCCU_FHSRVDS0_SERV_DID_MASK         (0xFU)
#define LPE_VFCCU_FHSRVDS0_SERV_DID_SHIFT        (0U)
#define LPE_VFCCU_FHSRVDS0_SERV_DID_WIDTH        (4U)
#define LPE_VFCCU_FHSRVDS0_SERV_DID(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHSRVDS0_SERV_DID_SHIFT)) & LPE_VFCCU_FHSRVDS0_SERV_DID_MASK)

#define LPE_VFCCU_FHSRVDS0_AGGFLTS_MASK          (0x100U)
#define LPE_VFCCU_FHSRVDS0_AGGFLTS_SHIFT         (8U)
#define LPE_VFCCU_FHSRVDS0_AGGFLTS_WIDTH         (1U)
#define LPE_VFCCU_FHSRVDS0_AGGFLTS(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHSRVDS0_AGGFLTS_SHIFT)) & LPE_VFCCU_FHSRVDS0_AGGFLTS_MASK)
/*! @} */

/*! @name FHFLTENC0_0 - Fault Enable */
/*! @{ */

#define LPE_VFCCU_FHFLTENC0_0_EN0_MASK           (0x1U)
#define LPE_VFCCU_FHFLTENC0_0_EN0_SHIFT          (0U)
#define LPE_VFCCU_FHFLTENC0_0_EN0_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN0(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN0_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN0_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN1_MASK           (0x2U)
#define LPE_VFCCU_FHFLTENC0_0_EN1_SHIFT          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN1_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN1(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN1_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN1_MASK)

