zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTENC0_0_EN2_MASK           (0x4U)
#define LPE_VFCCU_FHFLTENC0_0_EN2_SHIFT          (2U)
#define LPE_VFCCU_FHFLTENC0_0_EN2_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN2(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN2_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN2_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN3_MASK           (0x8U)
#define LPE_VFCCU_FHFLTENC0_0_EN3_SHIFT          (3U)
#define LPE_VFCCU_FHFLTENC0_0_EN3_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN3(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN3_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN3_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN4_MASK           (0x10U)
#define LPE_VFCCU_FHFLTENC0_0_EN4_SHIFT          (4U)
#define LPE_VFCCU_FHFLTENC0_0_EN4_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN4(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN4_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN4_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN5_MASK           (0x20U)
#define LPE_VFCCU_FHFLTENC0_0_EN5_SHIFT          (5U)
#define LPE_VFCCU_FHFLTENC0_0_EN5_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN5(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN5_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN5_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN6_MASK           (0x40U)
#define LPE_VFCCU_FHFLTENC0_0_EN6_SHIFT          (6U)
#define LPE_VFCCU_FHFLTENC0_0_EN6_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN6(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN6_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN6_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN7_MASK           (0x80U)
#define LPE_VFCCU_FHFLTENC0_0_EN7_SHIFT          (7U)
#define LPE_VFCCU_FHFLTENC0_0_EN7_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN7(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN7_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN7_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN8_MASK           (0x100U)
#define LPE_VFCCU_FHFLTENC0_0_EN8_SHIFT          (8U)
#define LPE_VFCCU_FHFLTENC0_0_EN8_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN8(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN8_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN8_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN9_MASK           (0x200U)
#define LPE_VFCCU_FHFLTENC0_0_EN9_SHIFT          (9U)
#define LPE_VFCCU_FHFLTENC0_0_EN9_WIDTH          (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN9(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN9_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN9_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN10_MASK          (0x400U)
#define LPE_VFCCU_FHFLTENC0_0_EN10_SHIFT         (10U)
#define LPE_VFCCU_FHFLTENC0_0_EN10_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN10(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN10_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN10_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN11_MASK          (0x800U)
#define LPE_VFCCU_FHFLTENC0_0_EN11_SHIFT         (11U)
#define LPE_VFCCU_FHFLTENC0_0_EN11_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN11(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN11_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN11_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN12_MASK          (0x1000U)
#define LPE_VFCCU_FHFLTENC0_0_EN12_SHIFT         (12U)
#define LPE_VFCCU_FHFLTENC0_0_EN12_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN12(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN12_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN12_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN13_MASK          (0x2000U)
#define LPE_VFCCU_FHFLTENC0_0_EN13_SHIFT         (13U)
#define LPE_VFCCU_FHFLTENC0_0_EN13_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN13(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN13_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN13_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN14_MASK          (0x4000U)
#define LPE_VFCCU_FHFLTENC0_0_EN14_SHIFT         (14U)
#define LPE_VFCCU_FHFLTENC0_0_EN14_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN14(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN14_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN14_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN15_MASK          (0x8000U)
#define LPE_VFCCU_FHFLTENC0_0_EN15_SHIFT         (15U)
#define LPE_VFCCU_FHFLTENC0_0_EN15_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN15(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN15_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN15_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN16_MASK          (0x10000U)
#define LPE_VFCCU_FHFLTENC0_0_EN16_SHIFT         (16U)
#define LPE_VFCCU_FHFLTENC0_0_EN16_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN16(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN16_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN16_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN17_MASK          (0x20000U)
#define LPE_VFCCU_FHFLTENC0_0_EN17_SHIFT         (17U)
#define LPE_VFCCU_FHFLTENC0_0_EN17_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN17(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN17_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN17_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN18_MASK          (0x40000U)
#define LPE_VFCCU_FHFLTENC0_0_EN18_SHIFT         (18U)
#define LPE_VFCCU_FHFLTENC0_0_EN18_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN18(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN18_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN18_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN19_MASK          (0x80000U)
#define LPE_VFCCU_FHFLTENC0_0_EN19_SHIFT         (19U)
#define LPE_VFCCU_FHFLTENC0_0_EN19_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN19(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN19_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN19_MASK)

#define LPE_VFCCU_FHFLTENC0_0_EN20_MASK          (0x100000U)
#define LPE_VFCCU_FHFLTENC0_0_EN20_SHIFT         (20U)
#define LPE_VFCCU_FHFLTENC0_0_EN20_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_0_EN20(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_0_EN20_SHIFT)) & LPE_VFCCU_FHFLTENC0_0_EN20_MASK)

