zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTENC0_1_EN40_MASK          (0x100U)
#define LPE_VFCCU_FHFLTENC0_1_EN40_SHIFT         (8U)
#define LPE_VFCCU_FHFLTENC0_1_EN40_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN40(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN40_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN40_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN41_MASK          (0x200U)
#define LPE_VFCCU_FHFLTENC0_1_EN41_SHIFT         (9U)
#define LPE_VFCCU_FHFLTENC0_1_EN41_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN41(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN41_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN41_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN42_MASK          (0x400U)
#define LPE_VFCCU_FHFLTENC0_1_EN42_SHIFT         (10U)
#define LPE_VFCCU_FHFLTENC0_1_EN42_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN42(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN42_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN42_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN43_MASK          (0x800U)
#define LPE_VFCCU_FHFLTENC0_1_EN43_SHIFT         (11U)
#define LPE_VFCCU_FHFLTENC0_1_EN43_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN43(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN43_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN43_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN44_MASK          (0x1000U)
#define LPE_VFCCU_FHFLTENC0_1_EN44_SHIFT         (12U)
#define LPE_VFCCU_FHFLTENC0_1_EN44_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN44(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN44_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN44_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN45_MASK          (0x2000U)
#define LPE_VFCCU_FHFLTENC0_1_EN45_SHIFT         (13U)
#define LPE_VFCCU_FHFLTENC0_1_EN45_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN45(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN45_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN45_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN46_MASK          (0x4000U)
#define LPE_VFCCU_FHFLTENC0_1_EN46_SHIFT         (14U)
#define LPE_VFCCU_FHFLTENC0_1_EN46_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN46(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN46_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN46_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN47_MASK          (0x8000U)
#define LPE_VFCCU_FHFLTENC0_1_EN47_SHIFT         (15U)
#define LPE_VFCCU_FHFLTENC0_1_EN47_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN47(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN47_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN47_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN48_MASK          (0x10000U)
#define LPE_VFCCU_FHFLTENC0_1_EN48_SHIFT         (16U)
#define LPE_VFCCU_FHFLTENC0_1_EN48_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN48(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN48_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN48_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN49_MASK          (0x20000U)
#define LPE_VFCCU_FHFLTENC0_1_EN49_SHIFT         (17U)
#define LPE_VFCCU_FHFLTENC0_1_EN49_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN49(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN49_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN49_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN50_MASK          (0x40000U)
#define LPE_VFCCU_FHFLTENC0_1_EN50_SHIFT         (18U)
#define LPE_VFCCU_FHFLTENC0_1_EN50_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN50(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN50_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN50_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN51_MASK          (0x80000U)
#define LPE_VFCCU_FHFLTENC0_1_EN51_SHIFT         (19U)
#define LPE_VFCCU_FHFLTENC0_1_EN51_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN51(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN51_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN51_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN52_MASK          (0x100000U)
#define LPE_VFCCU_FHFLTENC0_1_EN52_SHIFT         (20U)
#define LPE_VFCCU_FHFLTENC0_1_EN52_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN52(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN52_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN52_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN53_MASK          (0x200000U)
#define LPE_VFCCU_FHFLTENC0_1_EN53_SHIFT         (21U)
#define LPE_VFCCU_FHFLTENC0_1_EN53_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN53(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN53_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN53_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN54_MASK          (0x400000U)
#define LPE_VFCCU_FHFLTENC0_1_EN54_SHIFT         (22U)
#define LPE_VFCCU_FHFLTENC0_1_EN54_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN54(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN54_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN54_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN55_MASK          (0x800000U)
#define LPE_VFCCU_FHFLTENC0_1_EN55_SHIFT         (23U)
#define LPE_VFCCU_FHFLTENC0_1_EN55_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN55(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN55_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN55_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN56_MASK          (0x1000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN56_SHIFT         (24U)
#define LPE_VFCCU_FHFLTENC0_1_EN56_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN56(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN56_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN56_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN57_MASK          (0x2000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN57_SHIFT         (25U)
#define LPE_VFCCU_FHFLTENC0_1_EN57_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN57(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN57_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN57_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN58_MASK          (0x4000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN58_SHIFT         (26U)
#define LPE_VFCCU_FHFLTENC0_1_EN58_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN58(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN58_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN58_MASK)

