zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTENC0_1_EN59_MASK          (0x8000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN59_SHIFT         (27U)
#define LPE_VFCCU_FHFLTENC0_1_EN59_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN59(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN59_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN59_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN60_MASK          (0x10000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN60_SHIFT         (28U)
#define LPE_VFCCU_FHFLTENC0_1_EN60_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN60(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN60_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN60_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN61_MASK          (0x20000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN61_SHIFT         (29U)
#define LPE_VFCCU_FHFLTENC0_1_EN61_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN61(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN61_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN61_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN62_MASK          (0x40000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN62_SHIFT         (30U)
#define LPE_VFCCU_FHFLTENC0_1_EN62_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN62(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN62_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN62_MASK)

#define LPE_VFCCU_FHFLTENC0_1_EN63_MASK          (0x80000000U)
#define LPE_VFCCU_FHFLTENC0_1_EN63_SHIFT         (31U)
#define LPE_VFCCU_FHFLTENC0_1_EN63_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_1_EN63(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_1_EN63_SHIFT)) & LPE_VFCCU_FHFLTENC0_1_EN63_MASK)
/*! @} */

/*! @name FHFLTENC0_2 - Fault Enable */
/*! @{ */

#define LPE_VFCCU_FHFLTENC0_2_EN64_MASK          (0x1U)
#define LPE_VFCCU_FHFLTENC0_2_EN64_SHIFT         (0U)
#define LPE_VFCCU_FHFLTENC0_2_EN64_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN64(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN64_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN64_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN65_MASK          (0x2U)
#define LPE_VFCCU_FHFLTENC0_2_EN65_SHIFT         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN65_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN65(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN65_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN65_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN66_MASK          (0x4U)
#define LPE_VFCCU_FHFLTENC0_2_EN66_SHIFT         (2U)
#define LPE_VFCCU_FHFLTENC0_2_EN66_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN66(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN66_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN66_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN67_MASK          (0x8U)
#define LPE_VFCCU_FHFLTENC0_2_EN67_SHIFT         (3U)
#define LPE_VFCCU_FHFLTENC0_2_EN67_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN67(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN67_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN67_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN68_MASK          (0x10U)
#define LPE_VFCCU_FHFLTENC0_2_EN68_SHIFT         (4U)
#define LPE_VFCCU_FHFLTENC0_2_EN68_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN68(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN68_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN68_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN69_MASK          (0x20U)
#define LPE_VFCCU_FHFLTENC0_2_EN69_SHIFT         (5U)
#define LPE_VFCCU_FHFLTENC0_2_EN69_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN69(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN69_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN69_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN70_MASK          (0x40U)
#define LPE_VFCCU_FHFLTENC0_2_EN70_SHIFT         (6U)
#define LPE_VFCCU_FHFLTENC0_2_EN70_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN70(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN70_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN70_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN71_MASK          (0x80U)
#define LPE_VFCCU_FHFLTENC0_2_EN71_SHIFT         (7U)
#define LPE_VFCCU_FHFLTENC0_2_EN71_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN71(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN71_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN71_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN72_MASK          (0x100U)
#define LPE_VFCCU_FHFLTENC0_2_EN72_SHIFT         (8U)
#define LPE_VFCCU_FHFLTENC0_2_EN72_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN72(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN72_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN72_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN73_MASK          (0x200U)
#define LPE_VFCCU_FHFLTENC0_2_EN73_SHIFT         (9U)
#define LPE_VFCCU_FHFLTENC0_2_EN73_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN73(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN73_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN73_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN74_MASK          (0x400U)
#define LPE_VFCCU_FHFLTENC0_2_EN74_SHIFT         (10U)
#define LPE_VFCCU_FHFLTENC0_2_EN74_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN74(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN74_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN74_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN75_MASK          (0x800U)
#define LPE_VFCCU_FHFLTENC0_2_EN75_SHIFT         (11U)
#define LPE_VFCCU_FHFLTENC0_2_EN75_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN75(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN75_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN75_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN76_MASK          (0x1000U)
#define LPE_VFCCU_FHFLTENC0_2_EN76_SHIFT         (12U)
#define LPE_VFCCU_FHFLTENC0_2_EN76_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN76(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN76_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN76_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN77_MASK          (0x2000U)
#define LPE_VFCCU_FHFLTENC0_2_EN77_SHIFT         (13U)
#define LPE_VFCCU_FHFLTENC0_2_EN77_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN77(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN77_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN77_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN78_MASK          (0x4000U)
#define LPE_VFCCU_FHFLTENC0_2_EN78_SHIFT         (14U)
#define LPE_VFCCU_FHFLTENC0_2_EN78_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN78(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN78_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN78_MASK)

