zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTENC0_2_EN79_MASK          (0x8000U)
#define LPE_VFCCU_FHFLTENC0_2_EN79_SHIFT         (15U)
#define LPE_VFCCU_FHFLTENC0_2_EN79_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN79(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN79_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN79_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN80_MASK          (0x10000U)
#define LPE_VFCCU_FHFLTENC0_2_EN80_SHIFT         (16U)
#define LPE_VFCCU_FHFLTENC0_2_EN80_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN80(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN80_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN80_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN81_MASK          (0x20000U)
#define LPE_VFCCU_FHFLTENC0_2_EN81_SHIFT         (17U)
#define LPE_VFCCU_FHFLTENC0_2_EN81_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN81(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN81_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN81_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN82_MASK          (0x40000U)
#define LPE_VFCCU_FHFLTENC0_2_EN82_SHIFT         (18U)
#define LPE_VFCCU_FHFLTENC0_2_EN82_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN82(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN82_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN82_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN83_MASK          (0x80000U)
#define LPE_VFCCU_FHFLTENC0_2_EN83_SHIFT         (19U)
#define LPE_VFCCU_FHFLTENC0_2_EN83_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN83(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN83_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN83_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN84_MASK          (0x100000U)
#define LPE_VFCCU_FHFLTENC0_2_EN84_SHIFT         (20U)
#define LPE_VFCCU_FHFLTENC0_2_EN84_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN84(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN84_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN84_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN85_MASK          (0x200000U)
#define LPE_VFCCU_FHFLTENC0_2_EN85_SHIFT         (21U)
#define LPE_VFCCU_FHFLTENC0_2_EN85_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN85(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN85_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN85_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN86_MASK          (0x400000U)
#define LPE_VFCCU_FHFLTENC0_2_EN86_SHIFT         (22U)
#define LPE_VFCCU_FHFLTENC0_2_EN86_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN86(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN86_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN86_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN87_MASK          (0x800000U)
#define LPE_VFCCU_FHFLTENC0_2_EN87_SHIFT         (23U)
#define LPE_VFCCU_FHFLTENC0_2_EN87_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN87(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN87_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN87_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN88_MASK          (0x1000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN88_SHIFT         (24U)
#define LPE_VFCCU_FHFLTENC0_2_EN88_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN88(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN88_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN88_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN89_MASK          (0x2000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN89_SHIFT         (25U)
#define LPE_VFCCU_FHFLTENC0_2_EN89_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN89(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN89_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN89_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN90_MASK          (0x4000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN90_SHIFT         (26U)
#define LPE_VFCCU_FHFLTENC0_2_EN90_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN90(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN90_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN90_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN91_MASK          (0x8000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN91_SHIFT         (27U)
#define LPE_VFCCU_FHFLTENC0_2_EN91_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN91(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN91_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN91_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN92_MASK          (0x10000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN92_SHIFT         (28U)
#define LPE_VFCCU_FHFLTENC0_2_EN92_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN92(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN92_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN92_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN93_MASK          (0x20000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN93_SHIFT         (29U)
#define LPE_VFCCU_FHFLTENC0_2_EN93_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN93(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN93_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN93_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN94_MASK          (0x40000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN94_SHIFT         (30U)
#define LPE_VFCCU_FHFLTENC0_2_EN94_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN94(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN94_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN94_MASK)

#define LPE_VFCCU_FHFLTENC0_2_EN95_MASK          (0x80000000U)
#define LPE_VFCCU_FHFLTENC0_2_EN95_SHIFT         (31U)
#define LPE_VFCCU_FHFLTENC0_2_EN95_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_2_EN95(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_2_EN95_SHIFT)) & LPE_VFCCU_FHFLTENC0_2_EN95_MASK)
/*! @} */

/*! @name FHFLTENC0_3 - Fault Enable */
/*! @{ */

#define LPE_VFCCU_FHFLTENC0_3_EN96_MASK          (0x1U)
#define LPE_VFCCU_FHFLTENC0_3_EN96_SHIFT         (0U)
#define LPE_VFCCU_FHFLTENC0_3_EN96_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN96(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN96_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN96_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN97_MASK          (0x2U)
#define LPE_VFCCU_FHFLTENC0_3_EN97_SHIFT         (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN97_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN97(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN97_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN97_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN98_MASK          (0x4U)
#define LPE_VFCCU_FHFLTENC0_3_EN98_SHIFT         (2U)
#define LPE_VFCCU_FHFLTENC0_3_EN98_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN98(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN98_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN98_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN99_MASK          (0x8U)
#define LPE_VFCCU_FHFLTENC0_3_EN99_SHIFT         (3U)
#define LPE_VFCCU_FHFLTENC0_3_EN99_WIDTH         (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN99(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN99_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN99_MASK)

