zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTENC0_3_EN100_MASK         (0x10U)
#define LPE_VFCCU_FHFLTENC0_3_EN100_SHIFT        (4U)
#define LPE_VFCCU_FHFLTENC0_3_EN100_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN100(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN100_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN100_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN101_MASK         (0x20U)
#define LPE_VFCCU_FHFLTENC0_3_EN101_SHIFT        (5U)
#define LPE_VFCCU_FHFLTENC0_3_EN101_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN101(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN101_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN101_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN102_MASK         (0x40U)
#define LPE_VFCCU_FHFLTENC0_3_EN102_SHIFT        (6U)
#define LPE_VFCCU_FHFLTENC0_3_EN102_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN102(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN102_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN102_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN103_MASK         (0x80U)
#define LPE_VFCCU_FHFLTENC0_3_EN103_SHIFT        (7U)
#define LPE_VFCCU_FHFLTENC0_3_EN103_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN103(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN103_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN103_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN104_MASK         (0x100U)
#define LPE_VFCCU_FHFLTENC0_3_EN104_SHIFT        (8U)
#define LPE_VFCCU_FHFLTENC0_3_EN104_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN104(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN104_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN104_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN105_MASK         (0x200U)
#define LPE_VFCCU_FHFLTENC0_3_EN105_SHIFT        (9U)
#define LPE_VFCCU_FHFLTENC0_3_EN105_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN105(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN105_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN105_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN106_MASK         (0x400U)
#define LPE_VFCCU_FHFLTENC0_3_EN106_SHIFT        (10U)
#define LPE_VFCCU_FHFLTENC0_3_EN106_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN106(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN106_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN106_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN107_MASK         (0x800U)
#define LPE_VFCCU_FHFLTENC0_3_EN107_SHIFT        (11U)
#define LPE_VFCCU_FHFLTENC0_3_EN107_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN107(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN107_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN107_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN108_MASK         (0x1000U)
#define LPE_VFCCU_FHFLTENC0_3_EN108_SHIFT        (12U)
#define LPE_VFCCU_FHFLTENC0_3_EN108_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN108(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN108_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN108_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN109_MASK         (0x2000U)
#define LPE_VFCCU_FHFLTENC0_3_EN109_SHIFT        (13U)
#define LPE_VFCCU_FHFLTENC0_3_EN109_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN109(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN109_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN109_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN110_MASK         (0x4000U)
#define LPE_VFCCU_FHFLTENC0_3_EN110_SHIFT        (14U)
#define LPE_VFCCU_FHFLTENC0_3_EN110_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN110(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN110_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN110_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN111_MASK         (0x8000U)
#define LPE_VFCCU_FHFLTENC0_3_EN111_SHIFT        (15U)
#define LPE_VFCCU_FHFLTENC0_3_EN111_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN111(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN111_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN111_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN112_MASK         (0x10000U)
#define LPE_VFCCU_FHFLTENC0_3_EN112_SHIFT        (16U)
#define LPE_VFCCU_FHFLTENC0_3_EN112_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN112(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN112_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN112_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN113_MASK         (0x20000U)
#define LPE_VFCCU_FHFLTENC0_3_EN113_SHIFT        (17U)
#define LPE_VFCCU_FHFLTENC0_3_EN113_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN113(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN113_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN113_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN114_MASK         (0x40000U)
#define LPE_VFCCU_FHFLTENC0_3_EN114_SHIFT        (18U)
#define LPE_VFCCU_FHFLTENC0_3_EN114_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN114(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN114_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN114_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN115_MASK         (0x80000U)
#define LPE_VFCCU_FHFLTENC0_3_EN115_SHIFT        (19U)
#define LPE_VFCCU_FHFLTENC0_3_EN115_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN115(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN115_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN115_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN116_MASK         (0x100000U)
#define LPE_VFCCU_FHFLTENC0_3_EN116_SHIFT        (20U)
#define LPE_VFCCU_FHFLTENC0_3_EN116_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN116(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN116_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN116_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN117_MASK         (0x200000U)
#define LPE_VFCCU_FHFLTENC0_3_EN117_SHIFT        (21U)
#define LPE_VFCCU_FHFLTENC0_3_EN117_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN117(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN117_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN117_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN118_MASK         (0x400000U)
#define LPE_VFCCU_FHFLTENC0_3_EN118_SHIFT        (22U)
#define LPE_VFCCU_FHFLTENC0_3_EN118_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN118(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN118_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN118_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN119_MASK         (0x800000U)
#define LPE_VFCCU_FHFLTENC0_3_EN119_SHIFT        (23U)
#define LPE_VFCCU_FHFLTENC0_3_EN119_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN119(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN119_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN119_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN120_MASK         (0x1000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN120_SHIFT        (24U)
#define LPE_VFCCU_FHFLTENC0_3_EN120_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN120(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN120_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN120_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN121_MASK         (0x2000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN121_SHIFT        (25U)
#define LPE_VFCCU_FHFLTENC0_3_EN121_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN121(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN121_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN121_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN122_MASK         (0x4000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN122_SHIFT        (26U)
#define LPE_VFCCU_FHFLTENC0_3_EN122_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN122(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN122_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN122_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN123_MASK         (0x8000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN123_SHIFT        (27U)
#define LPE_VFCCU_FHFLTENC0_3_EN123_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN123(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN123_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN123_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN124_MASK         (0x10000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN124_SHIFT        (28U)
#define LPE_VFCCU_FHFLTENC0_3_EN124_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN124(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN124_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN124_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN125_MASK         (0x20000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN125_SHIFT        (29U)
#define LPE_VFCCU_FHFLTENC0_3_EN125_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN125(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN125_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN125_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN126_MASK         (0x40000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN126_SHIFT        (30U)
#define LPE_VFCCU_FHFLTENC0_3_EN126_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN126(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN126_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN126_MASK)

#define LPE_VFCCU_FHFLTENC0_3_EN127_MASK         (0x80000000U)
#define LPE_VFCCU_FHFLTENC0_3_EN127_SHIFT        (31U)
#define LPE_VFCCU_FHFLTENC0_3_EN127_WIDTH        (1U)
#define LPE_VFCCU_FHFLTENC0_3_EN127(x)           (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTENC0_3_EN127_SHIFT)) & LPE_VFCCU_FHFLTENC0_3_EN127_MASK)
/*! @} */

/*! @name FHFLTS0_0 - Fault Status */
/*! @{ */

#define LPE_VFCCU_FHFLTS0_0_STAT0_MASK           (0x1U)
#define LPE_VFCCU_FHFLTS0_0_STAT0_SHIFT          (0U)
#define LPE_VFCCU_FHFLTS0_0_STAT0_WIDTH          (1U)
#define LPE_VFCCU_FHFLTS0_0_STAT0(x)             (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_0_STAT0_SHIFT)) & LPE_VFCCU_FHFLTS0_0_STAT0_MASK)

