zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTS0_1_STAT51_MASK          (0x80000U)
#define LPE_VFCCU_FHFLTS0_1_STAT51_SHIFT         (19U)
#define LPE_VFCCU_FHFLTS0_1_STAT51_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT51(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT51_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT51_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT52_MASK          (0x100000U)
#define LPE_VFCCU_FHFLTS0_1_STAT52_SHIFT         (20U)
#define LPE_VFCCU_FHFLTS0_1_STAT52_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT52(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT52_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT52_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT53_MASK          (0x200000U)
#define LPE_VFCCU_FHFLTS0_1_STAT53_SHIFT         (21U)
#define LPE_VFCCU_FHFLTS0_1_STAT53_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT53(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT53_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT53_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT54_MASK          (0x400000U)
#define LPE_VFCCU_FHFLTS0_1_STAT54_SHIFT         (22U)
#define LPE_VFCCU_FHFLTS0_1_STAT54_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT54(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT54_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT54_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT55_MASK          (0x800000U)
#define LPE_VFCCU_FHFLTS0_1_STAT55_SHIFT         (23U)
#define LPE_VFCCU_FHFLTS0_1_STAT55_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT55(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT55_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT55_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT56_MASK          (0x1000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT56_SHIFT         (24U)
#define LPE_VFCCU_FHFLTS0_1_STAT56_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT56(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT56_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT56_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT57_MASK          (0x2000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT57_SHIFT         (25U)
#define LPE_VFCCU_FHFLTS0_1_STAT57_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT57(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT57_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT57_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT58_MASK          (0x4000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT58_SHIFT         (26U)
#define LPE_VFCCU_FHFLTS0_1_STAT58_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT58(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT58_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT58_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT59_MASK          (0x8000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT59_SHIFT         (27U)
#define LPE_VFCCU_FHFLTS0_1_STAT59_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT59(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT59_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT59_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT60_MASK          (0x10000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT60_SHIFT         (28U)
#define LPE_VFCCU_FHFLTS0_1_STAT60_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT60(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT60_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT60_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT61_MASK          (0x20000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT61_SHIFT         (29U)
#define LPE_VFCCU_FHFLTS0_1_STAT61_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT61(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT61_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT61_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT62_MASK          (0x40000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT62_SHIFT         (30U)
#define LPE_VFCCU_FHFLTS0_1_STAT62_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT62(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT62_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT62_MASK)

#define LPE_VFCCU_FHFLTS0_1_STAT63_MASK          (0x80000000U)
#define LPE_VFCCU_FHFLTS0_1_STAT63_SHIFT         (31U)
#define LPE_VFCCU_FHFLTS0_1_STAT63_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_1_STAT63(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_1_STAT63_SHIFT)) & LPE_VFCCU_FHFLTS0_1_STAT63_MASK)
/*! @} */

/*! @name FHFLTS0_2 - Fault Status */
/*! @{ */

#define LPE_VFCCU_FHFLTS0_2_STAT64_MASK          (0x1U)
#define LPE_VFCCU_FHFLTS0_2_STAT64_SHIFT         (0U)
#define LPE_VFCCU_FHFLTS0_2_STAT64_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT64(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT64_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT64_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT65_MASK          (0x2U)
#define LPE_VFCCU_FHFLTS0_2_STAT65_SHIFT         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT65_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT65(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT65_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT65_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT66_MASK          (0x4U)
#define LPE_VFCCU_FHFLTS0_2_STAT66_SHIFT         (2U)
#define LPE_VFCCU_FHFLTS0_2_STAT66_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT66(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT66_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT66_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT67_MASK          (0x8U)
#define LPE_VFCCU_FHFLTS0_2_STAT67_SHIFT         (3U)
#define LPE_VFCCU_FHFLTS0_2_STAT67_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT67(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT67_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT67_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT68_MASK          (0x10U)
#define LPE_VFCCU_FHFLTS0_2_STAT68_SHIFT         (4U)
#define LPE_VFCCU_FHFLTS0_2_STAT68_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT68(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT68_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT68_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT69_MASK          (0x20U)
#define LPE_VFCCU_FHFLTS0_2_STAT69_SHIFT         (5U)
#define LPE_VFCCU_FHFLTS0_2_STAT69_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT69(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT69_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT69_MASK)

