zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTS0_2_STAT70_MASK          (0x40U)
#define LPE_VFCCU_FHFLTS0_2_STAT70_SHIFT         (6U)
#define LPE_VFCCU_FHFLTS0_2_STAT70_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT70(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT70_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT70_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT71_MASK          (0x80U)
#define LPE_VFCCU_FHFLTS0_2_STAT71_SHIFT         (7U)
#define LPE_VFCCU_FHFLTS0_2_STAT71_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT71(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT71_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT71_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT72_MASK          (0x100U)
#define LPE_VFCCU_FHFLTS0_2_STAT72_SHIFT         (8U)
#define LPE_VFCCU_FHFLTS0_2_STAT72_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT72(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT72_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT72_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT73_MASK          (0x200U)
#define LPE_VFCCU_FHFLTS0_2_STAT73_SHIFT         (9U)
#define LPE_VFCCU_FHFLTS0_2_STAT73_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT73(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT73_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT73_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT74_MASK          (0x400U)
#define LPE_VFCCU_FHFLTS0_2_STAT74_SHIFT         (10U)
#define LPE_VFCCU_FHFLTS0_2_STAT74_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT74(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT74_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT74_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT75_MASK          (0x800U)
#define LPE_VFCCU_FHFLTS0_2_STAT75_SHIFT         (11U)
#define LPE_VFCCU_FHFLTS0_2_STAT75_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT75(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT75_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT75_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT76_MASK          (0x1000U)
#define LPE_VFCCU_FHFLTS0_2_STAT76_SHIFT         (12U)
#define LPE_VFCCU_FHFLTS0_2_STAT76_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT76(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT76_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT76_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT77_MASK          (0x2000U)
#define LPE_VFCCU_FHFLTS0_2_STAT77_SHIFT         (13U)
#define LPE_VFCCU_FHFLTS0_2_STAT77_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT77(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT77_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT77_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT78_MASK          (0x4000U)
#define LPE_VFCCU_FHFLTS0_2_STAT78_SHIFT         (14U)
#define LPE_VFCCU_FHFLTS0_2_STAT78_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT78(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT78_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT78_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT79_MASK          (0x8000U)
#define LPE_VFCCU_FHFLTS0_2_STAT79_SHIFT         (15U)
#define LPE_VFCCU_FHFLTS0_2_STAT79_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT79(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT79_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT79_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT80_MASK          (0x10000U)
#define LPE_VFCCU_FHFLTS0_2_STAT80_SHIFT         (16U)
#define LPE_VFCCU_FHFLTS0_2_STAT80_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT80(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT80_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT80_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT81_MASK          (0x20000U)
#define LPE_VFCCU_FHFLTS0_2_STAT81_SHIFT         (17U)
#define LPE_VFCCU_FHFLTS0_2_STAT81_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT81(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT81_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT81_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT82_MASK          (0x40000U)
#define LPE_VFCCU_FHFLTS0_2_STAT82_SHIFT         (18U)
#define LPE_VFCCU_FHFLTS0_2_STAT82_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT82(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT82_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT82_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT83_MASK          (0x80000U)
#define LPE_VFCCU_FHFLTS0_2_STAT83_SHIFT         (19U)
#define LPE_VFCCU_FHFLTS0_2_STAT83_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT83(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT83_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT83_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT84_MASK          (0x100000U)
#define LPE_VFCCU_FHFLTS0_2_STAT84_SHIFT         (20U)
#define LPE_VFCCU_FHFLTS0_2_STAT84_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT84(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT84_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT84_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT85_MASK          (0x200000U)
#define LPE_VFCCU_FHFLTS0_2_STAT85_SHIFT         (21U)
#define LPE_VFCCU_FHFLTS0_2_STAT85_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT85(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT85_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT85_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT86_MASK          (0x400000U)
#define LPE_VFCCU_FHFLTS0_2_STAT86_SHIFT         (22U)
#define LPE_VFCCU_FHFLTS0_2_STAT86_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT86(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT86_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT86_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT87_MASK          (0x800000U)
#define LPE_VFCCU_FHFLTS0_2_STAT87_SHIFT         (23U)
#define LPE_VFCCU_FHFLTS0_2_STAT87_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT87(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT87_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT87_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT88_MASK          (0x1000000U)
#define LPE_VFCCU_FHFLTS0_2_STAT88_SHIFT         (24U)
#define LPE_VFCCU_FHFLTS0_2_STAT88_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT88(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT88_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT88_MASK)

#define LPE_VFCCU_FHFLTS0_2_STAT89_MASK          (0x2000000U)
#define LPE_VFCCU_FHFLTS0_2_STAT89_SHIFT         (25U)
#define LPE_VFCCU_FHFLTS0_2_STAT89_WIDTH         (1U)
#define LPE_VFCCU_FHFLTS0_2_STAT89(x)            (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTS0_2_STAT89_SHIFT)) & LPE_VFCCU_FHFLTS0_2_STAT89_MASK)

