zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
/*! @name FHFLTRKC0_0 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL0_MASK       (0xFU)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL0_SHIFT      (0U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL0_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL0(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_0_RKNSEL0_SHIFT)) & LPE_VFCCU_FHFLTRKC0_0_RKNSEL0_MASK)

#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL1_MASK       (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL1_SHIFT      (8U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL1_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL1(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_0_RKNSEL1_SHIFT)) & LPE_VFCCU_FHFLTRKC0_0_RKNSEL1_MASK)

#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL2_MASK       (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL2_SHIFT      (16U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL2_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL2(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_0_RKNSEL2_SHIFT)) & LPE_VFCCU_FHFLTRKC0_0_RKNSEL2_MASK)

#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL3_MASK       (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL3_SHIFT      (24U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL3_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_0_RKNSEL3(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_0_RKNSEL3_SHIFT)) & LPE_VFCCU_FHFLTRKC0_0_RKNSEL3_MASK)
/*! @} */

/*! @name FHFLTRKC0_1 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL4_MASK       (0xFU)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL4_SHIFT      (0U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL4_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL4(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_1_RKNSEL4_SHIFT)) & LPE_VFCCU_FHFLTRKC0_1_RKNSEL4_MASK)

#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL5_MASK       (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL5_SHIFT      (8U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL5_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL5(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_1_RKNSEL5_SHIFT)) & LPE_VFCCU_FHFLTRKC0_1_RKNSEL5_MASK)

#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL6_MASK       (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL6_SHIFT      (16U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL6_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL6(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_1_RKNSEL6_SHIFT)) & LPE_VFCCU_FHFLTRKC0_1_RKNSEL6_MASK)

#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL7_MASK       (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL7_SHIFT      (24U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL7_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_1_RKNSEL7(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_1_RKNSEL7_SHIFT)) & LPE_VFCCU_FHFLTRKC0_1_RKNSEL7_MASK)
/*! @} */

/*! @name FHFLTRKC0_2 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL8_MASK       (0xFU)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL8_SHIFT      (0U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL8_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL8(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_2_RKNSEL8_SHIFT)) & LPE_VFCCU_FHFLTRKC0_2_RKNSEL8_MASK)

#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL9_MASK       (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL9_SHIFT      (8U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL9_WIDTH      (4U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL9(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_2_RKNSEL9_SHIFT)) & LPE_VFCCU_FHFLTRKC0_2_RKNSEL9_MASK)

#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL10_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL10_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL10_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL10(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_2_RKNSEL10_SHIFT)) & LPE_VFCCU_FHFLTRKC0_2_RKNSEL10_MASK)

#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL11_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL11_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL11_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_2_RKNSEL11(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_2_RKNSEL11_SHIFT)) & LPE_VFCCU_FHFLTRKC0_2_RKNSEL11_MASK)
/*! @} */

/*! @name FHFLTRKC0_3 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL12_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL12_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL12_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL12(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_3_RKNSEL12_SHIFT)) & LPE_VFCCU_FHFLTRKC0_3_RKNSEL12_MASK)

#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL13_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL13_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL13_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL13(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_3_RKNSEL13_SHIFT)) & LPE_VFCCU_FHFLTRKC0_3_RKNSEL13_MASK)

#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL14_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL14_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL14_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL14(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_3_RKNSEL14_SHIFT)) & LPE_VFCCU_FHFLTRKC0_3_RKNSEL14_MASK)

#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL15_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL15_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL15_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_3_RKNSEL15(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_3_RKNSEL15_SHIFT)) & LPE_VFCCU_FHFLTRKC0_3_RKNSEL15_MASK)
/*! @} */

/*! @name FHFLTRKC0_4 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL16_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL16_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL16_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL16(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_4_RKNSEL16_SHIFT)) & LPE_VFCCU_FHFLTRKC0_4_RKNSEL16_MASK)

#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL17_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL17_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL17_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL17(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_4_RKNSEL17_SHIFT)) & LPE_VFCCU_FHFLTRKC0_4_RKNSEL17_MASK)

#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL18_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL18_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL18_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL18(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_4_RKNSEL18_SHIFT)) & LPE_VFCCU_FHFLTRKC0_4_RKNSEL18_MASK)

#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL19_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL19_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL19_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_4_RKNSEL19(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_4_RKNSEL19_SHIFT)) & LPE_VFCCU_FHFLTRKC0_4_RKNSEL19_MASK)
/*! @} */

