zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
/*! @name FHFLTRKC0_5 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL20_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL20_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL20_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL20(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_5_RKNSEL20_SHIFT)) & LPE_VFCCU_FHFLTRKC0_5_RKNSEL20_MASK)

#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL21_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL21_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL21_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL21(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_5_RKNSEL21_SHIFT)) & LPE_VFCCU_FHFLTRKC0_5_RKNSEL21_MASK)

#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL22_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL22_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL22_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL22(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_5_RKNSEL22_SHIFT)) & LPE_VFCCU_FHFLTRKC0_5_RKNSEL22_MASK)

#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL23_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL23_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL23_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_5_RKNSEL23(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_5_RKNSEL23_SHIFT)) & LPE_VFCCU_FHFLTRKC0_5_RKNSEL23_MASK)
/*! @} */

/*! @name FHFLTRKC0_6 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL24_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL24_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL24_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL24(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_6_RKNSEL24_SHIFT)) & LPE_VFCCU_FHFLTRKC0_6_RKNSEL24_MASK)

#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL25_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL25_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL25_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL25(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_6_RKNSEL25_SHIFT)) & LPE_VFCCU_FHFLTRKC0_6_RKNSEL25_MASK)

#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL26_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL26_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL26_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL26(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_6_RKNSEL26_SHIFT)) & LPE_VFCCU_FHFLTRKC0_6_RKNSEL26_MASK)

#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL27_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL27_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL27_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_6_RKNSEL27(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_6_RKNSEL27_SHIFT)) & LPE_VFCCU_FHFLTRKC0_6_RKNSEL27_MASK)
/*! @} */

/*! @name FHFLTRKC0_7 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL28_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL28_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL28_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL28(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_7_RKNSEL28_SHIFT)) & LPE_VFCCU_FHFLTRKC0_7_RKNSEL28_MASK)

#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL29_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL29_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL29_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL29(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_7_RKNSEL29_SHIFT)) & LPE_VFCCU_FHFLTRKC0_7_RKNSEL29_MASK)

#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL30_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL30_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL30_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL30(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_7_RKNSEL30_SHIFT)) & LPE_VFCCU_FHFLTRKC0_7_RKNSEL30_MASK)

#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL31_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL31_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL31_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_7_RKNSEL31(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_7_RKNSEL31_SHIFT)) & LPE_VFCCU_FHFLTRKC0_7_RKNSEL31_MASK)
/*! @} */

/*! @name FHFLTRKC0_8 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL32_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL32_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL32_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL32(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_8_RKNSEL32_SHIFT)) & LPE_VFCCU_FHFLTRKC0_8_RKNSEL32_MASK)

#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL33_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL33_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL33_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL33(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_8_RKNSEL33_SHIFT)) & LPE_VFCCU_FHFLTRKC0_8_RKNSEL33_MASK)

#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL34_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL34_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL34_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL34(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_8_RKNSEL34_SHIFT)) & LPE_VFCCU_FHFLTRKC0_8_RKNSEL34_MASK)

#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL35_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL35_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL35_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_8_RKNSEL35(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_8_RKNSEL35_SHIFT)) & LPE_VFCCU_FHFLTRKC0_8_RKNSEL35_MASK)
/*! @} */

/*! @name FHFLTRKC0_9 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL36_MASK      (0xFU)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL36_SHIFT     (0U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL36_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL36(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_9_RKNSEL36_SHIFT)) & LPE_VFCCU_FHFLTRKC0_9_RKNSEL36_MASK)

#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL37_MASK      (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL37_SHIFT     (8U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL37_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL37(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_9_RKNSEL37_SHIFT)) & LPE_VFCCU_FHFLTRKC0_9_RKNSEL37_MASK)

#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL38_MASK      (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL38_SHIFT     (16U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL38_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL38(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_9_RKNSEL38_SHIFT)) & LPE_VFCCU_FHFLTRKC0_9_RKNSEL38_MASK)

#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL39_MASK      (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL39_SHIFT     (24U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL39_WIDTH     (4U)
#define LPE_VFCCU_FHFLTRKC0_9_RKNSEL39(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_9_RKNSEL39_SHIFT)) & LPE_VFCCU_FHFLTRKC0_9_RKNSEL39_MASK)
/*! @} */

/*! @name FHFLTRKC0_10 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL40_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL40_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL40_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL40(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_10_RKNSEL40_SHIFT)) & LPE_VFCCU_FHFLTRKC0_10_RKNSEL40_MASK)

