zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL41_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL41_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL41_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL41(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_10_RKNSEL41_SHIFT)) & LPE_VFCCU_FHFLTRKC0_10_RKNSEL41_MASK)

#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL42_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL42_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL42_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL42(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_10_RKNSEL42_SHIFT)) & LPE_VFCCU_FHFLTRKC0_10_RKNSEL42_MASK)

#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL43_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL43_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL43_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_10_RKNSEL43(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_10_RKNSEL43_SHIFT)) & LPE_VFCCU_FHFLTRKC0_10_RKNSEL43_MASK)
/*! @} */

/*! @name FHFLTRKC0_11 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL44_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL44_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL44_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL44(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_11_RKNSEL44_SHIFT)) & LPE_VFCCU_FHFLTRKC0_11_RKNSEL44_MASK)

#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL45_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL45_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL45_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL45(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_11_RKNSEL45_SHIFT)) & LPE_VFCCU_FHFLTRKC0_11_RKNSEL45_MASK)

#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL46_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL46_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL46_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL46(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_11_RKNSEL46_SHIFT)) & LPE_VFCCU_FHFLTRKC0_11_RKNSEL46_MASK)

#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL47_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL47_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL47_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_11_RKNSEL47(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_11_RKNSEL47_SHIFT)) & LPE_VFCCU_FHFLTRKC0_11_RKNSEL47_MASK)
/*! @} */

/*! @name FHFLTRKC0_12 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL48_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL48_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL48_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL48(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_12_RKNSEL48_SHIFT)) & LPE_VFCCU_FHFLTRKC0_12_RKNSEL48_MASK)

#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL49_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL49_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL49_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL49(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_12_RKNSEL49_SHIFT)) & LPE_VFCCU_FHFLTRKC0_12_RKNSEL49_MASK)

#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL50_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL50_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL50_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL50(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_12_RKNSEL50_SHIFT)) & LPE_VFCCU_FHFLTRKC0_12_RKNSEL50_MASK)

#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL51_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL51_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL51_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_12_RKNSEL51(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_12_RKNSEL51_SHIFT)) & LPE_VFCCU_FHFLTRKC0_12_RKNSEL51_MASK)
/*! @} */

/*! @name FHFLTRKC0_13 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL52_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL52_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL52_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL52(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_13_RKNSEL52_SHIFT)) & LPE_VFCCU_FHFLTRKC0_13_RKNSEL52_MASK)

#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL53_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL53_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL53_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL53(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_13_RKNSEL53_SHIFT)) & LPE_VFCCU_FHFLTRKC0_13_RKNSEL53_MASK)

#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL54_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL54_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL54_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL54(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_13_RKNSEL54_SHIFT)) & LPE_VFCCU_FHFLTRKC0_13_RKNSEL54_MASK)

#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL55_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL55_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL55_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_13_RKNSEL55(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_13_RKNSEL55_SHIFT)) & LPE_VFCCU_FHFLTRKC0_13_RKNSEL55_MASK)
/*! @} */

/*! @name FHFLTRKC0_14 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL56_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL56_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL56_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL56(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_14_RKNSEL56_SHIFT)) & LPE_VFCCU_FHFLTRKC0_14_RKNSEL56_MASK)

#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL57_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL57_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL57_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL57(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_14_RKNSEL57_SHIFT)) & LPE_VFCCU_FHFLTRKC0_14_RKNSEL57_MASK)

#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL58_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL58_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL58_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL58(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_14_RKNSEL58_SHIFT)) & LPE_VFCCU_FHFLTRKC0_14_RKNSEL58_MASK)

#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL59_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL59_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL59_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_14_RKNSEL59(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_14_RKNSEL59_SHIFT)) & LPE_VFCCU_FHFLTRKC0_14_RKNSEL59_MASK)
/*! @} */

/*! @name FHFLTRKC0_15 - Fault Reaction Set Configuration */
/*! @{ */

