zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL85_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL85_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL85_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL85(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_21_RKNSEL85_SHIFT)) & LPE_VFCCU_FHFLTRKC0_21_RKNSEL85_MASK)

#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL86_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL86_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL86_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL86(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_21_RKNSEL86_SHIFT)) & LPE_VFCCU_FHFLTRKC0_21_RKNSEL86_MASK)

#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL87_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL87_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL87_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_21_RKNSEL87(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_21_RKNSEL87_SHIFT)) & LPE_VFCCU_FHFLTRKC0_21_RKNSEL87_MASK)
/*! @} */

/*! @name FHFLTRKC0_22 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL88_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL88_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL88_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL88(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_22_RKNSEL88_SHIFT)) & LPE_VFCCU_FHFLTRKC0_22_RKNSEL88_MASK)

#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL89_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL89_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL89_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL89(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_22_RKNSEL89_SHIFT)) & LPE_VFCCU_FHFLTRKC0_22_RKNSEL89_MASK)

#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL90_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL90_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL90_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL90(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_22_RKNSEL90_SHIFT)) & LPE_VFCCU_FHFLTRKC0_22_RKNSEL90_MASK)

#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL91_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL91_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL91_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_22_RKNSEL91(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_22_RKNSEL91_SHIFT)) & LPE_VFCCU_FHFLTRKC0_22_RKNSEL91_MASK)
/*! @} */

/*! @name FHFLTRKC0_23 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL92_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL92_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL92_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL92(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_23_RKNSEL92_SHIFT)) & LPE_VFCCU_FHFLTRKC0_23_RKNSEL92_MASK)

#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL93_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL93_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL93_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL93(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_23_RKNSEL93_SHIFT)) & LPE_VFCCU_FHFLTRKC0_23_RKNSEL93_MASK)

#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL94_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL94_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL94_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL94(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_23_RKNSEL94_SHIFT)) & LPE_VFCCU_FHFLTRKC0_23_RKNSEL94_MASK)

#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL95_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL95_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL95_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_23_RKNSEL95(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_23_RKNSEL95_SHIFT)) & LPE_VFCCU_FHFLTRKC0_23_RKNSEL95_MASK)
/*! @} */

/*! @name FHFLTRKC0_24 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL96_MASK     (0xFU)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL96_SHIFT    (0U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL96_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL96(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_24_RKNSEL96_SHIFT)) & LPE_VFCCU_FHFLTRKC0_24_RKNSEL96_MASK)

#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL97_MASK     (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL97_SHIFT    (8U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL97_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL97(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_24_RKNSEL97_SHIFT)) & LPE_VFCCU_FHFLTRKC0_24_RKNSEL97_MASK)

#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL98_MASK     (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL98_SHIFT    (16U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL98_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL98(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_24_RKNSEL98_SHIFT)) & LPE_VFCCU_FHFLTRKC0_24_RKNSEL98_MASK)

#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL99_MASK     (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL99_SHIFT    (24U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL99_WIDTH    (4U)
#define LPE_VFCCU_FHFLTRKC0_24_RKNSEL99(x)       (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_24_RKNSEL99_SHIFT)) & LPE_VFCCU_FHFLTRKC0_24_RKNSEL99_MASK)
/*! @} */

/*! @name FHFLTRKC0_25 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL100_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL100_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL100_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL100(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_25_RKNSEL100_SHIFT)) & LPE_VFCCU_FHFLTRKC0_25_RKNSEL100_MASK)

#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL101_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL101_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL101_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL101(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_25_RKNSEL101_SHIFT)) & LPE_VFCCU_FHFLTRKC0_25_RKNSEL101_MASK)

#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL102_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL102_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL102_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL102(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_25_RKNSEL102_SHIFT)) & LPE_VFCCU_FHFLTRKC0_25_RKNSEL102_MASK)

#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL103_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL103_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL103_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_25_RKNSEL103(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_25_RKNSEL103_SHIFT)) & LPE_VFCCU_FHFLTRKC0_25_RKNSEL103_MASK)
/*! @} */

/*! @name FHFLTRKC0_26 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL104_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL104_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL104_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL104(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_26_RKNSEL104_SHIFT)) & LPE_VFCCU_FHFLTRKC0_26_RKNSEL104_MASK)

#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL105_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL105_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL105_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL105(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_26_RKNSEL105_SHIFT)) & LPE_VFCCU_FHFLTRKC0_26_RKNSEL105_MASK)

#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL106_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL106_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL106_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL106(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_26_RKNSEL106_SHIFT)) & LPE_VFCCU_FHFLTRKC0_26_RKNSEL106_MASK)

#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL107_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL107_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL107_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_26_RKNSEL107(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_26_RKNSEL107_SHIFT)) & LPE_VFCCU_FHFLTRKC0_26_RKNSEL107_MASK)
/*! @} */

