zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
/*! @name FHFLTRKC0_27 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL108_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL108_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL108_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL108(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_27_RKNSEL108_SHIFT)) & LPE_VFCCU_FHFLTRKC0_27_RKNSEL108_MASK)

#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL109_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL109_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL109_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL109(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_27_RKNSEL109_SHIFT)) & LPE_VFCCU_FHFLTRKC0_27_RKNSEL109_MASK)

#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL110_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL110_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL110_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL110(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_27_RKNSEL110_SHIFT)) & LPE_VFCCU_FHFLTRKC0_27_RKNSEL110_MASK)

#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL111_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL111_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL111_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_27_RKNSEL111(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_27_RKNSEL111_SHIFT)) & LPE_VFCCU_FHFLTRKC0_27_RKNSEL111_MASK)
/*! @} */

/*! @name FHFLTRKC0_28 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL112_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL112_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL112_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL112(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_28_RKNSEL112_SHIFT)) & LPE_VFCCU_FHFLTRKC0_28_RKNSEL112_MASK)

#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL113_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL113_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL113_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL113(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_28_RKNSEL113_SHIFT)) & LPE_VFCCU_FHFLTRKC0_28_RKNSEL113_MASK)

#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL114_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL114_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL114_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL114(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_28_RKNSEL114_SHIFT)) & LPE_VFCCU_FHFLTRKC0_28_RKNSEL114_MASK)

#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL115_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL115_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL115_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_28_RKNSEL115(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_28_RKNSEL115_SHIFT)) & LPE_VFCCU_FHFLTRKC0_28_RKNSEL115_MASK)
/*! @} */

/*! @name FHFLTRKC0_29 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL116_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL116_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL116_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL116(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_29_RKNSEL116_SHIFT)) & LPE_VFCCU_FHFLTRKC0_29_RKNSEL116_MASK)

#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL117_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL117_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL117_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL117(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_29_RKNSEL117_SHIFT)) & LPE_VFCCU_FHFLTRKC0_29_RKNSEL117_MASK)

#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL118_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL118_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL118_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL118(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_29_RKNSEL118_SHIFT)) & LPE_VFCCU_FHFLTRKC0_29_RKNSEL118_MASK)

#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL119_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL119_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL119_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_29_RKNSEL119(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_29_RKNSEL119_SHIFT)) & LPE_VFCCU_FHFLTRKC0_29_RKNSEL119_MASK)
/*! @} */

/*! @name FHFLTRKC0_30 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL120_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL120_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL120_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL120(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_30_RKNSEL120_SHIFT)) & LPE_VFCCU_FHFLTRKC0_30_RKNSEL120_MASK)

#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL121_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL121_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL121_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL121(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_30_RKNSEL121_SHIFT)) & LPE_VFCCU_FHFLTRKC0_30_RKNSEL121_MASK)

#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL122_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL122_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL122_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL122(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_30_RKNSEL122_SHIFT)) & LPE_VFCCU_FHFLTRKC0_30_RKNSEL122_MASK)

#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL123_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL123_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL123_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_30_RKNSEL123(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_30_RKNSEL123_SHIFT)) & LPE_VFCCU_FHFLTRKC0_30_RKNSEL123_MASK)
/*! @} */

/*! @name FHFLTRKC0_31 - Fault Reaction Set Configuration */
/*! @{ */

#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL124_MASK    (0xFU)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL124_SHIFT   (0U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL124_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL124(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_31_RKNSEL124_SHIFT)) & LPE_VFCCU_FHFLTRKC0_31_RKNSEL124_MASK)

#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL125_MASK    (0xF00U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL125_SHIFT   (8U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL125_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL125(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_31_RKNSEL125_SHIFT)) & LPE_VFCCU_FHFLTRKC0_31_RKNSEL125_MASK)

#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL126_MASK    (0xF0000U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL126_SHIFT   (16U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL126_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL126(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_31_RKNSEL126_SHIFT)) & LPE_VFCCU_FHFLTRKC0_31_RKNSEL126_MASK)

#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL127_MASK    (0xF000000U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL127_SHIFT   (24U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL127_WIDTH   (4U)
#define LPE_VFCCU_FHFLTRKC0_31_RKNSEL127(x)      (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHFLTRKC0_31_RKNSEL127_SHIFT)) & LPE_VFCCU_FHFLTRKC0_31_RKNSEL127_MASK)
/*! @} */

