zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPE_VFCCU.h
#define LPE_VFCCU_FHIMRKC0_150_RKNEN1_MASK       (0x2U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN1_SHIFT      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN1_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN1(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN1_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN1_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN2_MASK       (0x4U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN2_SHIFT      (2U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN2_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN2(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN2_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN2_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN3_MASK       (0x8U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN3_SHIFT      (3U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN3_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN3(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN3_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN3_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN4_MASK       (0x10U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN4_SHIFT      (4U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN4_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN4(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN4_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN4_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN5_MASK       (0x20U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN5_SHIFT      (5U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN5_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN5(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN5_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN5_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN6_MASK       (0x40U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN6_SHIFT      (6U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN6_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN6(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN6_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN6_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN7_MASK       (0x80U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN7_SHIFT      (7U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN7_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN7(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN7_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN7_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN8_MASK       (0x100U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN8_SHIFT      (8U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN8_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN8(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN8_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN8_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN9_MASK       (0x200U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN9_SHIFT      (9U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN9_WIDTH      (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN9(x)         (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN9_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN9_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN10_MASK      (0x400U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN10_SHIFT     (10U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN10_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN10(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN10_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN10_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN11_MASK      (0x800U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN11_SHIFT     (11U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN11_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN11(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN11_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN11_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN12_MASK      (0x1000U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN12_SHIFT     (12U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN12_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN12(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN12_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN12_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN13_MASK      (0x2000U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN13_SHIFT     (13U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN13_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN13(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN13_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN13_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN14_MASK      (0x4000U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN14_SHIFT     (14U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN14_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN14(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN14_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN14_MASK)

#define LPE_VFCCU_FHIMRKC0_150_RKNEN15_MASK      (0x8000U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN15_SHIFT     (15U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN15_WIDTH     (1U)
#define LPE_VFCCU_FHIMRKC0_150_RKNEN15(x)        (((uint32_t)(((uint32_t)(x)) << LPE_VFCCU_FHIMRKC0_150_RKNEN15_SHIFT)) & LPE_VFCCU_FHIMRKC0_150_RKNEN15_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LPE_VFCCU_Register_Masks */

/*!
 * @}
 */ /* end of group LPE_VFCCU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_LPE_VFCCU_H_) */
